[
  {
    "name": "Forsyth Nature Center",
    "lat": 41.8476108,
    "lng": -73.990622,
    "location": "125 Lucas Ave, Kingston, NY 12401",
    "cost": "Free",
    "description": "A compact petting zoo and garden just the right size for small children, with a fantastic playground nearby.",
    "place_id": "ChIJAYk4eQ0T2IkRL8Ea14UKjVs",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJAYk4eQ0T2IkRL8Ea14UKjVs",
    "place_query": "Forsyth Nature Center, Kingston, NY",
    "season": "Year-round",
    "full_description": "The Forsyth Nature Center offers more than two dozen animal exhibits and seasonal gardens that encourage a connection to the natural world. Open year-round and free to the public, it’s a small, kid-friendly petting zoo featuring peacocks, goats, alpacas, and other animals in an intimate setting. Adjacent to the nature center is Forsyth Park’s large wooden playground—designed like a castle with towers and parapets—providing additional space for imaginative play.",
    "website": "https://www.kingston-ny.gov/forsyth-nature-center"
  },
  {
    "name": "The Strong National Museum of Play",
    "lat": 43.1525482,
    "lng": -77.601629,
    "location": "1 Manhattan Square Dr, Rochester, NY 14607",
    "cost": "Admission fee",
    "description": "A world-class children’s museum devoted to play, with interactive exhibits and the National Toy Hall of Fame.",
    "place_id": "ChIJ8V4sPge11okRpmQC_nR4DQo",
    "place_query": "The Strong Museum of Play, Rochester, NY",
    "season": "Year-round",
    "full_description": "The Strong Museum is a massive, hands-on museum dedicated entirely to the importance of play. It features interactive exhibits on favorite childhood toys, classic arcade and video games, Sesame Street, and more. Home to the National Toy Hall of Fame and World Video Game Hall of Fame, this museum offers endless imaginative experiences for kids (and nostalgic adults) across its two floors, including a butterfly garden, indoor playgrounds, a miniature Wegmans grocery store, and a historic carousel.",
    "website": "https://www.museumofplay.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJ8V4sPge11okRpmQC_nR4DQo"
  },
  {
    "name": "Rosamond Gifford Zoo",
    "lat": 43.0431701,
    "lng": -76.1810721,
    "location": "1 Conservation Pl, Syracuse, NY 13204",
    "cost": "Admission fee",
    "description": "A family-friendly 43-acre zoo known for its Asian elephants, big cats, penguins, and engaging year-round exhibits.",
    "place_id": "ChIJBytUbeDz2YkREmii33QAD7o",
    "place_query": "Rosamond Gifford Zoo, Syracuse, NY",
    "season": "Year-round",
    "full_description": "The Rosamond Gifford Zoo at Burnet Park is a mid-sized AZA-accredited zoo home to over 700 animals on 43 acres. Popular residents include Asian elephants, lions, Amur tigers, penguins, and red pandas. The zoo features indoor exhibits (helpful in winter) like the tropical aviary and aquarium, as well as outdoor trails for larger animals. It offers interactive experiences such as feeding lorikeets and a barn area, making it a fun, educational outing that’s open all year (with shortened hours in winter).",
    "website": "https://www.rosamondgiffordzoo.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJBytUbeDz2YkREmii33QAD7o"
  },
  {
    "name": "Buffalo Zoo",
    "lat": 42.9371231,
    "lng": -78.85160909999999,
    "location": "300 Parkside Ave, Buffalo, NY 14214",
    "cost": "Admission fee",
    "description": "One of America’s oldest zoos, featuring a broad range of animals (from lions to polar bears) in the heart of Buffalo’s Delaware Park.",
    "place_id": "ChIJ4eSGubIS04kRd-1TTcybNYk",
    "place_query": "Buffalo Zoo, Buffalo, NY",
    "season": "Year-round",
    "full_description": "Founded in 1875, the Buffalo Zoo is the third-oldest zoo in the United States. It spans 23 acres and houses hundreds of animals, including big cats, gorillas, giraffes, and a renowned Arctic Edge exhibit with polar bears and Arctic wolves. The zoo offers interactive experiences like giraffe feedings and a petting zoo area for farm animals. With modern habitats (rainforest, reptiles, and more) and year-round operations (outdoor animals may be off-display in extreme cold), it’s a beloved family attraction in Buffalo’s Delaware Park.",
    "website": "https://buffalozoo.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJ4eSGubIS04kRd-1TTcybNYk"
  },
  {
    "name": "Seneca Park Zoo",
    "lat": 43.2048845,
    "lng": -77.6238437,
    "location": "2222 St. Paul St, Rochester, NY 14621",
    "cost": "Admission fee",
    "description": "A smaller, easy-to-explore zoo along the Genesee River, featuring African animals, an eco-friendly focus, and a large playground.",
    "place_id": "ChIJnYFx5JC21okRtvCHJuRTHQ4",
    "place_query": "Seneca Park Zoo, Rochester, NY",
    "season": "Year-round",
    "full_description": "Seneca Park Zoo is an intimate zoo situated in a scenic park along Rochester’s Genesee River. Recent expansions have added African savanna animals like Masai giraffes, zebras, and a white rhino, complementing longtime residents such as lions, elephants, and penguins. The zoo emphasizes conservation and education, offering interactive experiences like a large playground and a “Discovery Zone” for kids. It’s manageable in size — perfect for a 1-2 hour family visit — and open year-round (with indoor viewing areas for colder months).",
    "website": "https://senecaparkzoo.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJnYFx5JC21okRtvCHJuRTHQ4"
  },
  {
    "name": "The Wild Animal Park",
    "lat": 43.1193,
    "lng": -75.8943,
    "location": "7621 Lakeport Rd, Chittenango, NY 13037",
    "cost": "Admission fee",
    "description": "A 14-acre zoo and safari park known for interactive animal encounters, from feeding giraffes and farm animals to up-close safari tours.",
    "place_id": null,
    "place_query": "The Wild Animal Park, Chittenango, NY",
    "season": "Spring–Fall",
    "full_description": "The Wild Animal Park is a hands-on zoo that offers a unique opportunity to get close to a wide range of exotic and domestic animals. Set on 14 acres in Chittenango, the park features giraffes, zebras, camels, wolves, reptiles, and more. Kids can feed giraffes from a platform, pet and feed friendly goats and deer in the petting area, and even take a guided safari ride (“Ride the Wildside”) to see bison, ostriches, and other animals roaming in open habitats. With frequent educational talks and a fun, interactive atmosphere, this seasonal park (open spring through fall) makes for an exciting family adventure.",
    "website": "https://www.wildanimalpark.com/"
  },
  {
    "name": "Fort Rickey Discovery Zoo",
    "lat": 43.2179,
    "lng": -75.506,
    "location": "5135 Rome-New London Rd, Rome, NY 13440",
    "cost": "Admission fee",
    "description": "A small, family-focused zoo emphasizing interaction, where kids can pet and feed deer and baby goats and enjoy a playground with slides and ball pits.",
    "place_id": null,
    "place_query": "Fort Rickey Discovery Zoo, Rome, NY",
    "season": "Summer–Fall",
    "full_description": "Fort Rickey Discovery Zoo is a children’s zoo designed for fun, learning, and lots of interaction. This quaint park invites kids to feed and pet gentle fallow deer in a walk-through enclosure and cuddle and bottle-feed baby goats in the “maternity ward.” Daily animal shows introduce visitors to creatures like wolves, owls, or reptiles. The zoo also features a giant tube-and-tunnel playground with a ball pit and slides, offering active play to complement the animal encounters. Open in the summer and early fall, Fort Rickey provides an engaging, hands-on experience that young children will remember.",
    "website": "https://www.fortrickey.com/"
  },
  {
    "name": "Old McDonald’s Farm",
    "lat": 43.9604,
    "lng": -76.0513,
    "location": "14369 County Route 145, Sackets Harbor, NY 13685",
    "cost": "Admission fee",
    "description": "A real working farm turned petting zoo with over 1,000 animals (from cows and goats to camels and reindeer), hayrides, and kid-friendly farm fun.",
    "place_id": null,
    "place_query": "Old McDonald's Farm, Sackets Harbor, NY",
    "season": "Late Spring–Fall",
    "full_description": "Old McDonald’s Farm is an expansive 120-acre working dairy farm that doubles as an interactive agritourism destination for families. Kids can meet and feed a wide variety of animals — not just farm staples like cows, sheep, chickens, and goats, but also unusual residents like camels, alpacas, zebus, and even reindeer. The farm features a “Moo Town” barn with dozens of calves to bottle-feed, pony rides, a mini train ride, and seasonal hayride tours themed to The Wizard of Oz. With over 1,000 animals on site and countless opportunities to touch and learn, this farm offers an authentic and memorable farm-play experience from May through October."
  },
  {
    "name": "Adirondack Animal Land",
    "lat": 43.0806,
    "lng": -74.3033,
    "location": "3554 State Highway 30, Gloversville, NY 12078",
    "cost": "Admission fee",
    "description": "Upstate’s largest petting zoo, featuring safari ride tours through free-roaming animals and a walk-through zoo with exotic and farm species.",
    "place_id": null,
    "place_query": "Adirondack Animal Land, Gloversville, NY",
    "season": "Summer",
    "full_description": "Adirondack Animal Land is a 80-acre wildlife park and petting zoo known for its drive-thru safari adventure. Visitors can hop on a guided wagon ride that winds through a large enclosure where bison, zebras, ostriches, and other animals roam freely — often approaching for a treat. In the walk-through portion of the park, families encounter camels, kangaroos, lemurs, and many farm animals that can be fed by hand. There’s also a large aviary where parakeets will perch on seed sticks held by visitors. Open in the summer season, Adirondack Animal Land provides a fun blend of gentle farm encounters and exotic animal viewing, set against the scenic foothills of the Adirondacks.",
    "website": "https://www.adirondackanimalland.com/"
  },
  {
    "name": "Hidden Valley Animal Adventure",
    "lat": 42.7424816,
    "lng": -78.2997687,
    "location": "2887 Royce Rd, Varysburg, NY 14167",
    "cost": "Admission fee",
    "description": "A drive-through safari park in Western NY where visitors can ride or drive among herds of bison, elk, and other wildlife, plus a small petting zoo area.",
    "place_id": "ChIJQVKPIwm404kRWeJngkIYbB8",
    "place_query": "Hidden Valley Animal Adventure, Varysburg, NY",
    "season": "Spring–Fall",
    "full_description": "Hidden Valley Animal Adventure offers an up-close safari experience in the hills of Wyoming County. Guests can take a guided trolley tour or self-drive through the park’s 60+ acres to see and feed over 300 animals representing 40 species, including bison, water buffalo, elk, zebras, emus, and Scottish highland cattle. Animals often walk right up to the vehicle, eagerly taking feed from cups. After the safari, families can visit the small petting zoo area to interact with friendly farm animals like goats and llamas. The park also features a lodge-style restaurant and viewing deck overlooking the scenic grounds. It’s a seasonal attraction typically open from May through October.",
    "website": "https://www.hiddenvalleyadventure.com/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJQVKPIwm404kRWeJngkIYbB8"
  },
  {
    "name": "Explore & More Children’s Museum",
    "lat": 42.8778245,
    "lng": -78.87802769999999,
    "location": "130 Main St, Buffalo, NY 14202",
    "cost": "Admission fee",
    "description": "A newly-built children’s museum at Buffalo’s Canalside, offering four floors of hands-on exhibits themed around Buffalo’s history, STEM, art, and active play.",
    "place_id": "ChIJEWov6H-o04kRmloLkchc8KE",
    "place_query": "Explore & More Children's Museum, Buffalo, NY",
    "season": "Year-round",
    "full_description": "Explore & More – The Ralph C. Wilson, Jr. Children’s Museum is a 43,000-square-foot facility filled with interactive, play-based exhibits. Located at Canalside on the Buffalo waterfront, the museum’s themed areas let kids learn through play about architecture, sports, farm-to-table nutrition, local Buffalo history, and more. Children can build in the Construction Zone, create art in the Art Studio, climb and slide through a two-story treehouse, and even explore a mini Buffalo waterfront with replica boats and bridges. With water play tables, a moving STEM lab, and toddler-specific zones, Explore & More offers a diverse, inclusive play environment that’s open all year (closed on some Mondays/Tuesdays in winter).",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJEWov6H-o04kRmloLkchc8KE"
  },
  {
    "name": "Sciencenter",
    "lat": 42.449849,
    "lng": -76.50406500000001,
    "location": "601 1st St, Ithaca, NY 14850",
    "cost": "Admission fee",
    "description": "A hands-on science museum in the Finger Lakes where kids can experiment with physics, meet live aquarium animals, and play on an outdoor musical playground.",
    "place_id": "ChIJj4MZoH-B0IkRyGBFpk7ffSA",
    "place_query": "Sciencenter, Ithaca, NY",
    "season": "Year-round",
    "full_description": "The Sciencenter in Ithaca is an interactive science museum geared toward kids of all ages. Inside, it features over 250 exhibits that invite children to experiment and learn by doing — from a giant physics playground of pulleys and levers to a tide-pool touch tank with starfish and sea urchins. Young visitors can climb through a multistory play structure or try hands-on activities in the Discovery Space. Outside, the Sciencenter’s courtyard houses a musical instrument playground and a mini-golf course that teaches about sound and astronomy. Open year-round (with rotating exhibits and special programs), the Sciencenter makes STEM learning fun in a family-friendly way.",
    "website": "https://www.sciencenter.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJj4MZoH-B0IkRyGBFpk7ffSA"
  },
  {
    "name": "Children’s Museum at Saratoga",
    "lat": 43.0646321,
    "lng": -73.7904313,
    "location": "69 Caroline St, Saratoga Springs, NY 12866",
    "cost": "Admission fee",
    "description": "A two-story play museum filled with imaginative play spaces (like a diner, farm, and fire truck) designed for toddlers and young children.",
    "place_id": "ChIJQXGZ7dk53okRexjr7LOncik",
    "place_query": "Children's Museum at Saratoga, Saratoga Springs, NY",
    "season": "Year-round",
    "full_description": "The Children’s Museum at Saratoga is a charming play space in downtown Saratoga Springs that encourages young kids (primarily ages 0–7) to explore and pretend. The museum’s intimate, two-floor setup includes a variety of themed rooms: little ones can shop at a kid-sized grocery store, perform check-ups in a pretend veterinary clinic, serve food in a 1950s-style diner, and climb aboard a life-size fire engine. There’s also a dedicated toddler play area and rotating hands-on science and art stations. The museum hosts frequent story times and craft activities, making it a wonderful year-round destination for families with small children.",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJQXGZ7dk53okRexjr7LOncik"
  },
  {
    "name": "Discovery Center of the Southern Tier",
    "lat": 42.0738133,
    "lng": -75.9037491,
    "location": "60 Morgan Rd, Binghamton, NY 13903",
    "cost": "Admission fee",
    "description": "An interactive children’s museum with over 30 play-and-learn exhibits (plus an outdoor Story Garden) encouraging imaginative role-play and exploration.",
    "place_id": "ChIJBVeriFHv2okR9sHoHXq_uMg",
    "place_query": "Discovery Center, Binghamton, NY",
    "season": "Year-round",
    "full_description": "The Discovery Center of the Southern Tier in Binghamton is a vibrant hands-on museum where children can role-play and explore various real-world environments. Indoors, kids can pretend to be a dentist, shop in a mini grocery store, milk a life-size model cow on a pretend farm, anchor the news in a TV studio, and more among the 30+ interactive exhibits. Outside, the Story Garden brings beloved children’s books to life with themed playhouses and sculptures (like the Goodnight Moon room and Peter Rabbit’s garden) in a safe, enclosed garden setting. Geared toward ages 1–10, the Discovery Center provides an enriching, imaginative play experience year-round, with outdoor exhibits best enjoyed in warm weather.",
    "website": "https://www.discoverycenter.org/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJBVeriFHv2okR9sHoHXq_uMg"
  },
  {
    "name": "Legoland New York Resort",
    "lat": 41.3305,
    "lng": -74.3217,
    "location": "1 Legoland Blvd, Goshen, NY 10924",
    "cost": "Ticketed admission",
    "description": "A LEGO-themed amusement park designed for ages 2–12, with brick-inspired rides, mini cities built from millions of LEGO bricks, and a whimsical onsite hotel.",
    "place_id": null,
    "place_query": "Legoland New York, Goshen, NY",
    "season": "Spring–Fall",
    "full_description": "LEGOLAND New York is a 150-acre theme park packed with colorful LEGO-inspired fun. It features seven themed lands filled with gentle rides and activities perfect for younger kids: splash and play in Pirate Shores, conquer the Dragon coaster in LEGO Castle, train in Ninja skills at LEGO Ninjago World, and drive electric LEGO cars on real roads at LEGO City. One of the park’s most impressive attractions is MINILAND, where famous cityscapes and landmarks (New York City, Washington D.C., etc.) are recreated in astonishing detail using millions of LEGO bricks. The park also offers 4D movies, character meet-and-greets, and many hands-on building zones for creative downtime. Generally open from spring through early winter (the park closes in the coldest months), LEGOLAND provides a multi-day destination experience, complete with a LEGO-themed hotel next door for those who want to extend the fun overnight.",
    "website": "https://www.legoland.com/new-york/"
  },
  {
    "name": "Santa’s Workshop",
    "lat": 44.2881,
    "lng": -73.8653,
    "location": "324 Whiteface Memorial Hwy, Wilmington, NY 12997",
    "cost": "Admission fee",
    "description": "A classic Christmas-themed amusement park in the Adirondacks (opened in 1949), where kids can meet Santa and his reindeer, enjoy gentle rides, and stroll through a storybook North Pole village.",
    "place_id": null,
    "place_query": "Santa's Workshop, North Pole, NY",
    "season": "Seasonal (Summer & select Holiday dates)",
    "full_description": "Santa’s Workshop in North Pole, NY, is one of the oldest theme parks in the US, enchanting families since 1949 with its perpetual Christmas charm. Designed like a cozy alpine village, the park lets kids visit Santa Claus in his summer home and pet his real reindeer. Elves stroll the grounds singing carols, and there are kiddie rides like the Candy Cane Train, the Carousel, and Santa’s Sleigh coaster (a gentle roller coaster suitable for small children). Magic shows, a Nativity pageant, and sweet treats like candy canes and hot cocoa add to the holiday atmosphere. Open during the summer months and again for special weekends around Christmas, Santa’s Workshop offers a nostalgic step into a Christmas fantasy land that’s especially magical for children under 8."
  },
  {
    "name": "Enchanted Forest Water Safari",
    "lat": 43.7171694,
    "lng": -74.96661329999999,
    "location": "3183 NY-28, Old Forge, NY 13420",
    "cost": "Ticketed admission",
    "description": "New York’s largest water theme park, set in the Adirondacks, with over 50 water rides and attractions (all heated!), plus classic amusement rides and a circus show.",
    "place_id": "ChIJIzZ0VFO12IkRwPvfqOicof0",
    "place_query": "Enchanted Forest Water Safari, Old Forge, NY",
    "season": "Summer",
    "full_description": "Enchanted Forest Water Safari is a summertime favorite, offering a mix of water park thrills and amusement park charm amidst the Adirondack Mountains. The park boasts more than 50 attractions, including 33 water rides – from kid-friendly splash pads and tube floats to adrenaline-pumping slides like the Killermanjaro (one of the tallest free-fall slides in the Northeast). All the water is heated to a comfortable ~80°F, ensuring fun even if the mountain air is brisk. In addition to water rides, the park maintains a retro “Enchanted Forest” vibe with storybook-themed displays, a family circus show, classic dry rides (bumper cars, a vintage carousel, a Ferris wheel), and even a small petting zoo. Open roughly from late June through Labor Day, Water Safari delivers a full day of cooling fun for families, with plenty of Adirondack flavor.",
    "website": "https://www.watersafari.com/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJIzZ0VFO12IkRwPvfqOicof0"
  },
  {
    "name": "Six Flags Great Escape & Hurricane Harbor",
    "lat": 43.3510828,
    "lng": -73.6892326,
    "location": "1172 State Route 9, Queensbury, NY 12804",
    "cost": "Ticketed admission",
    "description": "A major theme park near Lake George featuring a mix of thrill rides, family rides, a large water park, and a fairy tale-themed kids section (originally Storytown USA).",
    "place_id": "ChIJr5YIqArP34kRDiWXeBkIJzE",
    "place_query": "Six Flags Great Escape, Queensbury, NY",
    "season": "Late Spring–Fall",
    "full_description": "Six Flags Great Escape is a long-standing amusement park (opened in 1954 as Storytown USA) that provides fun for all ages in the Lake George region. The park has over 135 rides, shows, and attractions. For adrenaline seekers, there are roller coasters like the wooden classic Comet and the looping Boomerang. Younger kids will love Timbertown and Storytown sections, which retain a fairy-tale theme with gentle rides like spinning teacups, a Cinderella coach, and a petting zoo atmosphere. The attached Hurricane Harbor water park (included with admission) offers wave pools, water slides, and a lazy river to cool off on hot days. Great Escape operates seasonally from late spring through Halloween, when it transforms for “Fright Fest” in October. Its blend of kiddie nostalgia and modern thrills — plus an on-site lodge with an indoor water park — makes it a top family destination in upstate NY.",
    "website": "https://www.sixflags.com/greatescape",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJr5YIqArP34kRDiWXeBkIJzE"
  },
  {
    "name": "Seabreeze Amusement Park",
    "lat": 43.23221520000001,
    "lng": -77.5423136,
    "location": "4600 Culver Rd, Rochester, NY 14622",
    "cost": "Ticketed admission",
    "description": "A historic family-owned amusement park overlooking Lake Ontario in Rochester, offering roller coasters, classic midway rides, a water park, and free weekly entertainment.",
    "place_id": "ChIJLboTEDfI1okR4KUv0b0xdAM",
    "place_query": "Seabreeze Amusement Park, Rochester, NY",
    "season": "Summer",
    "full_description": "Seabreeze is a beloved traditional amusement park that has entertained Rochester families for generations (it opened in 1879!). Perched on a bluff by Lake Ontario, Seabreeze packs an impressive variety of attractions into its footprint. The park’s four roller coasters include the Jack Rabbit (a 102-year-old wooden coaster, one of the oldest operating in the world) and the spinning Whirlwind coaster. There are plenty of classic rides like the carousel, bumper cars, train, Ferris wheel, and a log flume, as well as kiddie rides for little ones. On hot days, the attached Raging Rivers Waterpark offers a wave pool, lazy river, and several waterslides (and even those are included in admission). Seabreeze’s manageable size, picturesque lake views, free parking, and frequent live shows (like musical revues and magic acts) make it an easy, fun outing for families during its summer season (late May through early September).",
    "website": "https://seabreeze.com/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJLboTEDfI1okR4KUv0b0xdAM"
  },
  {
    "name": "Six Flags Darien Lake",
    "lat": 42.9271561,
    "lng": -78.3854439,
    "location": "9993 Allegheny Rd, Corfu, NY 14036",
    "cost": "Ticketed admission",
    "description": "Western New York’s largest theme park, featuring high-adrenaline roller coasters, a sizable water park, live concerts, and campground resort facilities.",
    "place_id": "ChIJY6dTF9WV04kRAXEZBjwF0fo",
    "place_query": "Six Flags Darien Lake, NY",
    "season": "Summer",
    "full_description": "Six Flags Darien Lake is a sprawling amusement park and resort located between Buffalo and Rochester. It offers a full spectrum of thrill rides, including the Ride of Steel hypercoaster (over 200 feet tall), the looping Tantrum coaster, and classics like the wooden Predator. Families will find plenty of milder rides as well, from the Big Wheel and antique cars to a Looney Tunes kids area with pint-sized rides. Darien Lake’s SplashTown water park (included with admission) boasts a large wave pool, a lazy river, and numerous water slides for all ages. Uniquely, the property also includes a large campground and hotel, allowing guests to stay overnight and enjoy park amenities like evening concerts at the on-site amphitheater. Operating roughly May through October (with a big Halloween festival), Darien Lake is the premier summer theme park experience in Western NY.",
    "website": "https://www.sixflags.com/darienlake",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJY6dTF9WV04kRAXEZBjwF0fo"
  },
  {
    "name": "Watkins Glen State Park",
    "lat": 42.3672123,
    "lng": -76.901592,
    "location": "1009 N Franklin St, Watkins Glen, NY 14891",
    "cost": "Free (parking $10 in season)",
    "description": "A stunning Finger Lakes gorge park where families can hike a trail past 19 waterfalls, walking behind cascades and over stone bridges in an unforgettable natural canyon.",
    "place_id": "ChIJS_CTFgBf0IkR3hZneHJBI38",
    "place_query": "Watkins Glen State Park, NY",
    "season": "Spring–Fall (gorge trail)",
    "full_description": "Watkins Glen State Park is often considered one of the most beautiful state parks in the country, famous for its dramatic gorge trail. Over the course of a roughly 2-mile hike (with shuttle options available), visitors climb and descend alongside Glen Creek, encountering 19 waterfalls that tumble through the ancient shale and limestone cliffs. Families will walk behind the curtain of water at Cavern Cascade, spiral up stone steps in the Tunnel behind Rainbow Falls, and cross picturesque stone bridges arching over cascades. The gorge trail is well-maintained but has about 800 stone steps, so it’s best for school-age kids and up (or little ones in carriers). In addition to the gorge, the park offers a large playground, an Olympic-size swimming pool (summer), and picnic facilities. The gorge trail is open roughly May through October (closed in winter due to ice), during which time Watkins Glen provides a truly magical outdoor adventure for families.",
    "website": "https://parks.ny.gov/parks/142",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJS_CTFgBf0IkR3hZneHJBI38"
  },
  {
    "name": "Letchworth State Park",
    "lat": 42.5848,
    "lng": -78.0511,
    "location": "1 Letchworth State Park, Castile, NY 14427",
    "cost": "Free (parking $10 in season)",
    "description": "Known as the “Grand Canyon of the East,” this expansive park features three major waterfalls on the Genesee River, spectacular gorge overlooks, plus trails, a nature center, and seasonal hot-air balloon rides.",
    "place_id": null,
    "place_query": "Letchworth State Park, NY",
    "season": "Year-round",
    "full_description": "Letchworth State Park offers awe-inspiring scenery across its 17-mile gorge, where the Genesee River plunges over three massive waterfalls set amid steep, forested cliffs. Families can easily view the Upper, Middle, and Lower Falls from accessible walkways and overlooks (the view from Inspiration Point is a highlight). Kids will love feeling the mist from the roaring Middle Falls and crossing the historic footbridge below the Lower Falls. Beyond the waterfalls, Letchworth has 60+ miles of hiking trails (many short and family-friendly), playgrounds and large picnic areas, a nature center with interactive exhibits, and even opportunities for adventure like rafting or riding in a hot-air balloon above the gorge (in summer). In winter, snow tubing and guided nature walks are offered. With cabins, campsites, and year-round natural beauty, Letchworth provides a fantastic outdoor experience in any season.",
    "website": "https://parks.ny.gov/parks/79"
  },
  {
    "name": "Boldt Castle (Heart Island)",
    "lat": 44.34434,
    "lng": -75.92265300000001,
    "location": "Heart Island, Alexandria Bay, NY 13607",
    "cost": "Admission fee (boat required)",
    "description": "A fairy-tale castle in the Thousand Islands accessible only by boat, offering self-guided tours through its ornate halls and scenic grounds that spark the imagination of kids and adults alike.",
    "place_id": "ChIJEWCVKDk5zUwRyi6yl4SMmGc",
    "place_query": "Boldt Castle, Alexandria Bay, NY",
    "season": "May–October",
    "full_description": "Boldt Castle is a magnificent 120-room castle set on Heart Island in the St. Lawrence River, built in the early 1900s and left abandoned for decades before being restored. Visiting is like stepping into a fairy tale. Families take a short ferry or tour boat from Alexandria Bay to reach the island. Once there, you can explore the castle’s grand halls, sweeping staircase, and furnished rooms (children often love imagining princesses and knights roaming the corridors). The grounds feature beautiful gardens, a stone children’s playhouse, and a picturesque Power House and clock tower by the water’s edge. Informational displays tell the romantic and tragic story of how the castle came to be. Kids will especially enjoy the winding staircase to the castle dome for a view, and feeding the giant fish visible in the clear river waters from the docks. Open from mid-May through mid-October, Boldt Castle makes for a magical half-day adventure in the Thousand Islands.",
    "website": "https://www.boldtcastle.com/",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJEWCVKDk5zUwRyi6yl4SMmGc"
  },
  {
    "name": "The Farmers’ Museum",
    "lat": 42.7141055,
    "lng": -74.9285495,
    "location": "5775 NY-80, Cooperstown, NY 13326",
    "cost": "Admission fee",
    "description": "A living history museum in Cooperstown with a 19th-century village and farm, complete with costumed interpreters, heritage farm animals, and an antique carousel for kids.",
    "place_id": "ChIJkUzZ3tIA3IkRnupy6ccHB30",
    "place_query": "The Farmers' Museum, Cooperstown, NY",
    "season": "Spring–Fall (limited winter hours)",
    "full_description": "The Farmers’ Museum immerses families in rural American life circa 1845. This open-air museum features a recreated country village with historic buildings (blacksmith shop, one-room schoolhouse, general store, etc.) populated by costumed interpreters demonstrating period crafts and chores. Children can watch (or help) the printer set type, see a blacksmith hammering iron, or try traditional games on the village green. The working farm has barns with friendly heritage-breed animals — think sheep, pigs, chickens, and Milking Shorthorn cows — and daily activities like cow milking or feeding time that kids can observe. A highlight for many families is the Empire State Carousel: a beautiful hand-carved merry-go-round featuring 25 animals native to New York (like a deer, eagle, or beaver) to ride on. The museum is generally open April through October, with special events and limited operations in winter, and provides a fun, educational glimpse into the past in a very kid-friendly way.",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJkUzZ3tIA3IkRnupy6ccHB30"
  },
  {
    "name": "Mid-Hudson Children’s Museum (MHCM)",
    "lat": 41.708847,
    "lng": -73.9392633,
    "location": "75 N Water St, Poughkeepsie, NY 12601",
    "cost": "Admission fee",
    "description": "An interactive discovery center along the Hudson River for young children, featuring playful exhibits about science, nature, and local Hudson Valley community life.",
    "place_id": "ChIJMYceRt493YkRBINBQDYDsQI",
    "place_query": "Mid-Hudson Children's Museum, Poughkeepsie, NY",
    "season": "Year-round",
    "full_description": "The Mid-Hudson Children’s Museum (recently renamed the Mid-Hudson Discovery Museum) offers a variety of hands-on exhibits tailored for infants to early elementary kids. Located on the Poughkeepsie waterfront, the museum has bright, engaging play areas: little ones can shop and cook in the Hudson Valley Farm stand market, climb aboard a river ferry boat replica, experiment with air and physics at the Ballfall Mountain exhibit, and create giant bubbles in the Bubble Garden. There’s also an Early Learning Junction with train tables and toddler-friendly toys. Outside, the museum has a fun new Science Garden with interactive musical instruments and sensory play equipment. MHCM is open all year (closed on some Mondays) and frequently hosts special programs like storytimes and science workshops, making it a wonderful indoor play and learning destination in the Hudson Valley.",
    "google_maps_url": "https://www.google.com/maps/place/?q=place_id:ChIJMYceRt493YkRBINBQDYDsQI"
  },
  {
    "name": "Animal Adventure Park",
    "lat": 42.1902,
    "lng": -75.7428,
    "location": "85 Martin Hill Rd, Harpursville, NY 13787",
    "cost": "Admission fee",
    "description": "A private zoo famous for April the giraffe, offering up-close encounters with giraffes, sloths, camels, and many other exotic animals, plus petting zoo areas and playgrounds.",
    "place_id": null,
    "place_query": "Animal Adventure Park, Harpursville, NY",
    "season": "Spring–Fall",
    "full_description": "Animal Adventure Park is an interactive zoo in rural Broome County that gained worldwide fame in 2017 when its giraffe, April, gave birth live on camera. Today, visitors can meet April’s offspring — giraffes Oliver and Tajiri — up close at the giraffe deck, feeding them lettuce by hand. The park features over 300 animals of 100 species, from big cats like Jaguars and lions to kangaroos, wallabies, zebra, bison, and capybara. Many exhibits are designed for interaction: you can hand-feed apples to camels, brush Nigerian dwarf goats in the petting area, and even book special encounters to hold a sloth or pet an anteater. There are multiple play areas for kids, including a prehistoric themed playground and a small dinosaur park with animatronic dinos. Generally open mid-April through late fall, Animal Adventure Park provides an unforgettable, hands-on animal experience that’s both fun and educational for children and adults.",
    "website": "https://www.theanimaladventurepark.com/"
  },
    {
      "name": "Catskill Animal Sanctuary",
      "lat": 42.0487,
      "lng": -74.0063,
      "location": "316 Old Stage Rd, Saugerties, NY 12477",
      "cost": "Admission fee (free under age 3)",
      "description": "A 150-acre refuge for rescued farm animals, with family tours that let kids meet friendly cows, pigs, goats, and more.",
      "place_id": null,
      "place_query": "Catskill Animal Sanctuary, Saugerties, NY",
      "season": "Spring–Fall (limited winter hours)",
      "full_description": "Catskill Animal Sanctuary is a nonprofit refuge for rescued farm animals on 150 acres in Saugerties. Families can join guided tours to meet more than 300 residents—cows, pigs, goats, sheep, chickens, and horses—all living in a safe, humane environment. The sanctuary emphasizes kindness and education, giving children a chance to pet goats, scratch pigs behind the ears, and hear rescue stories that foster empathy. A small kids’ barnyard area and shaded walking paths make it manageable for little legs. Tours run April through November, with occasional winter events."
    },
    {
      "name": "Rail Explorers Catskills",
      "lat": 42.0847,
      "lng": -74.3136,
      "location": "70 Lower High St, Phoenicia, NY 12464",
      "cost": "Ticketed admission",
      "description": "Pedal-powered rail bikes that roll along scenic Esopus Creek, suitable for families with kids (child seats available).",
      "place_id": null,
      "place_query": "Rail Explorers Catskills, Phoenicia, NY",
      "season": "Spring–Fall",
      "full_description": "Rail Explorers offers a novel way for families to explore the Catskills: four- and two-seat pedal-powered rail bikes that glide along a historic Ulster & Delaware rail line. The 8-mile round trip hugs the Esopus Creek and winds through forested scenery. It’s safe and easy—geared for all ages—and child seats are available for toddlers. Kids love the novelty of riding the rails, while adults enjoy the leisurely pace and views. Tours operate seasonally from spring through late fall."
    },
    {
      "name": "Ashokan Rail Trail",
      "lat": 41.9619,
      "lng": -74.2478,
      "location": "1285 NY-28, West Hurley, NY 12491 (Trailhead)",
      "cost": "Free",
      "description": "An 11.5-mile, stroller-friendly trail along the Ashokan Reservoir with mountain views and birdwatching opportunities.",
      "place_id": null,
      "place_query": "Ashokan Rail Trail, West Hurley, NY",
      "season": "Year-round",
      "full_description": "The Ashokan Rail Trail is a smooth, wide, car-free path that runs 11.5 miles along the northern edge of the Ashokan Reservoir. Families can walk, bike, or push strollers while enjoying sweeping views of the water and Catskill peaks. Kids may spot bald eagles, herons, or turtles along the way. Multiple access points have parking and restrooms, and the trail surface is crushed stone, making it stroller- and wheelchair-friendly. Open year-round, it’s especially beautiful in fall foliage season."
    },
    {
      "name": "Belleayre Mountain Beach",
      "lat": 42.1413,
      "lng": -74.4945,
      "location": "33 Friendship Manor Rd, Pine Hill, NY 12465",
      "cost": "Admission fee (per person, free under age 7)",
      "description": "A family beach on a Catskills lake with swimming, pedal boats, picnic areas, and a sandy shoreline for young children.",
      "place_id": null,
      "place_query": "Belleayre Beach at Pine Hill Lake, NY",
      "season": "Summer",
      "full_description": "Belleayre Beach at Pine Hill Lake is a family-friendly summer spot in the Catskills. It offers a sandy swimming area with lifeguards, shallow entry for kids, and water rentals like pedal boats and kayaks. The park also features shaded picnic pavilions, a volleyball court, and a playground. With clean facilities and mountain scenery, it’s a low-key and affordable way to spend a warm day with children. Open Memorial Day through Labor Day."
    },
    {
      "name": "Time and the Valleys Museum",
      "lat": 41.8975,
      "lng": -74.5219,
      "location": "332 Main St, Grahamsville, NY 12740",
      "cost": "Admission fee (free under age 6)",
      "description": "A small history and water museum with interactive exhibits on local farms, reservoirs, and old-time Catskills life.",
      "place_id": null,
      "place_query": "Time and the Valleys Museum, Grahamsville, NY",
      "season": "Spring–Fall",
      "full_description": "The Time and the Valleys Museum brings Catskills history alive in a family-friendly way. Kids can step into a 1930s general store, handle old farming tools, and explore an interactive exhibit about how the New York City water supply reservoirs were built. The recreated one-room schoolhouse is a highlight for children who like role-playing. Seasonal outdoor programs and family days add hands-on crafts and demonstrations. Open April through October."
    },
    {
      "name": "Woodstock Farm Sanctuary",
      "lat": 41.6538,
      "lng": -74.2796,
      "location": "2 Rescue Rd, High Falls, NY 12440",
      "cost": "Admission fee",
      "description": "A nonprofit animal sanctuary where families can tour barns, meet rescued cows and goats, and picnic in a peaceful Catskills setting.",
      "place_id": null,
      "place_query": "Woodstock Farm Sanctuary, High Falls, NY",
      "season": "Spring–Fall",
      "full_description": "Woodstock Farm Sanctuary offers guided weekend tours introducing families to hundreds of rescued farm animals — from cows lounging in fields to friendly goats eager for attention. The sanctuary emphasizes compassion and humane education, making it both fun and meaningful for children. Picnic areas and wide open spaces add to the appeal. Tours are seasonal, typically running April through November."
    }
  ]
