[
  {
    "region": "Adirondacks",
    "trails": [
      {
        "name": "Adirondak Loj Trailhead (Heart Lake)",
        "lat": 44.1825,
        "lng": -73.967,
        "location": "1002 Adirondack Loj Rd, Lake Placid, NY 12946",
        "region": "Adirondacks",
        "difficulty_range": "Easy–Hard",
        "season": "Year-round",
        "description": "High Peaks gateway at Heart Lake providing access to Mt. Marcy, Algonquin Peak and other major summits.",
        "full_description": "Historic lodge trailhead operated by the Adirondack Mountain Club, located on Heart Lake and hosting the start of the popular Van Hoevenberg Trail to New York’s two highest peaks. Offers hikes ranging from the easy nature trails (e.g. Mount Jo) to challenging 7+ mile ascents of High Peaks like Marcy, with parking, a visitor center, and facilities available year-round.",
        "place_id": null,
        "place_query": "Adirondack Loj Trailhead Lake Placid NY"
      },
      {
        "name": "The Garden Trailhead (Keene Valley)",
        "lat": 44.1891,
        "lng": -73.8159,
        "location": "Interbrook Rd, Keene Valley, NY 12943",
        "region": "Adirondacks",
        "difficulty_range": "Moderate–Hard",
        "season": "Spring–Fall",
        "description": "Small but very popular trailhead serving as the primary access to the Adirondacks’ Great Range and Johns Brook Valley.",
        "full_description": "A famously crowded High Peaks trailhead (capacity ~35 cars) that’s the jumping-off point for hikes to multiple High Peaks such as Gothics, Big Slide, and Mount Marcy’s north side. Hikers descend a short road to Johns Brook and can either backpack to Johns Brook Lodge (~3.5 mi in) or take day hikes; the site is so vital that a shuttle operates in summer when its lot fills. Expect a moderate to steep start and excellent wilderness access from this gateway.",
        "place_id": null,
        "place_query": "The Garden Trailhead Keene Valley NY"
      },
      {
        "name": "Cascade Mountain Trailhead",
        "lat": 44.2191,
        "lng": -73.8875,
        "location": "Route 73, between Lake Placid & Keene, NY",
        "region": "Adirondacks",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead for one of the Adirondacks’ most accessible High Peaks, offering a short steep hike to panoramic 4,000‑foot summits.",
        "full_description": "Located along Route 73 near the Cascade Lakes, this official trailhead leads to Cascade Mountain (4,098′) and Porter Mountain. The 2.4-mile (one-way) trail is rocky and steep in parts but is widely regarded as the easiest High Peak climb, making Cascade “a very popular area for hiking” in all seasons. Hikers are rewarded with 360° views at the summit, which is why Cascade is often recommended for beginners seeking a big Adirondack payoff.",
        "place_id": null,
        "place_query": "Cascade Mountain Trailhead Adirondacks NY"
      },
      {
        "name": "Ampersand Mountain Trailhead",
        "lat": 44.25147,
        "lng": -74.23942,
        "location": "Route 3, between Saranac Lake & Tupper Lake, NY",
        "region": "Adirondacks",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Official DEC trailhead to a 3,350′ “bald” summit rewarding hikers with a 360° vista over the Saranac Lakes region.",
        "full_description": "This signed parking area on NY Route 3 marks the start of the Ampersand Mountain trail – a 5.4-mile round trip that climbs ~1,800 feet to a rocky, treeless summit. The ascent is steep in its upper half, but the effort is well worth it: Ampersand is celebrated as “one of the Adirondacks’ most rewarding moderate hikes, offering expansive summit views” over lakes and forests. The trail is popular year-round (microspikes or snowshoes needed in winter) and showcases classic Adirondack scenery, including dense woods, mossy boulders, and an open summit with panoramic vistas.",
        "place_id": null,
        "place_query": "Ampersand Mountain Trailhead NY"
      },
      {
        "name": "Blue Mountain Trailhead",
        "lat": 43.8751,
        "lng": -74.4314,
        "location": "Route 30, 1 mile north of Blue Mountain Lake, NY",
        "region": "Adirondacks",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Popular family-friendly trailhead leading up a 2-mile route to Blue Mountain’s fire tower, known for its panoramic Adirondack vistas.",
        "full_description": "This trailhead off Route 30 provides a short but steep 2.0-mile hike (gain ~1,550’) through a heavily used path to the 3,750′ summit of Blue Mountain. The mountain’s fire tower offers 360° views of the central Adirondacks, and the hike is “nonetheless a popular hike” despite not being a High Peak, due to its moderate length and incredible summit panorama. The parking area is sizable and the route is well-marked, though eroded in places from high use. It’s an ideal half-day hike for families and those looking for a classic fire-tower experience in any season.",
        "place_id": null,
        "place_query": "Blue Mountain trailhead Adirondacks NY"
      },
      {
        "name": "Bald (Rondaxe) Mountain Trailhead",
        "lat": 43.74549,
        "lng": -74.90004,
        "location": "Rondaxe Rd, Old Forge, NY 13420",
        "region": "Adirondacks",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead for a short 1-mile climb to the Rondaxe Fire Tower, one of the Adirondacks’ most popular short hikes offering sweeping lake vistas.",
        "full_description": "Located north of Old Forge, this well-developed trailhead leads to Bald Mountain’s 2,350′ summit in just under a mile of steep but manageable hiking. The route features rocky outcrops and a famed 1917 fire tower at the top, from which hikers can enjoy panoramic views of the Fulton Chain Lakes. Bald Mountain is extremely popular – “the trail leading up the mountain is a popular hike… due to its proximity to tourist towns” and its big payoff for relatively little effort. Expect a large parking area and crowds on summer days as families and beginners tackle this iconic Adirondack fire-tower hike.",
        "place_id": null,
        "place_query": "Rondaxe Bald Mountain trailhead Old Forge NY"
      },
      {
        "name": "Upper Works Trailhead (Tahawus)",
        "lat": 44.081,
        "lng": -74.055,
        "location": "Upper Works Rd, Newcomb, NY 12852",
        "region": "Adirondacks",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Remote southern High Peaks trailhead steeped in history, where hikers begin long wilderness routes to Mt. Marcy, Algonquin (via Lake Colden), Allen, and the Santanoni Range.",
        "full_description": "Situated at the end of a 6-mile gravel road beyond the old Tahawus mine, the Upper Works trailhead offers a “unique option for hikers” as the southern gateway to the High Peaks Wilderness. Hikers depart near ruins of a 19th-century ironworks and follow trails like the Calamity Brook Trail – the shortest southern approach to Mt. Marcy (10+ miles one-way). The area is rich in history (Teddy Roosevelt famously began his midnight ride from here in 1901) and Open Space Institute improvements allow visitors to “walk through history” as they pass interpretive signs and an old blast furnace en route to the official trail register. From multi-day peak-bagging trips to shorter hikes to Flowed Lands or Mt. Adams, Upper Works is a must for experienced hikers seeking solitude and Adirondack lore.",
        "place_id": null,
        "place_query": "Upper Works trailhead Tahawus NY"
      },
      {
        "name": "Rooster Comb Trailhead",
        "lat": 44.1885,
        "lng": -73.7693,
        "location": "NY-73, Keene Valley, NY 12943",
        "region": "Adirondacks",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "A central Keene Valley trailhead leading to the Rooster Comb summit, Snow Mountain, and as a gateway into the Great Range.",
        "full_description": "This official parking lot on Route 73 in Keene Valley provides direct access to the Rooster Comb trail, a moderate 4.8-mile round trip climb that rewards hikers with sweeping views of Giant Mountain, the Great Range, and Keene Valley itself. The trail also connects to Snow Mountain for additional vistas, and further links into the Great Range trail system. It's a less intimidating but still rewarding alternative to the High Peaks climbs, making it a very popular hike year-round.",
        "place_id": null,
        "place_query": "Rooster Comb Trailhead Keene Valley NY"
      },
      {
        "name": "Chapel Pond Trailhead (Giant Mountain via Ridge Trail)",
        "lat": 44.1338,
        "lng": -73.7432,
        "location": "Chapel Pond, NY-73, Keene, NY 12942",
        "region": "Adirondacks",
        "difficulty_range": "Hard",
        "season": "Year-round",
        "description": "Steep trailhead climbing Giant Mountain, one of the most scenic High Peaks, with exposed ridges and open views.",
        "full_description": "Located across from Chapel Pond, this trailhead starts the Ridge Trail up Giant Mountain (4,627′). It's one of the most direct High Peak routes, gaining over 3,000′ in just 3 miles. The climb is strenuous but offers frequent open ledges with panoramic views of the Adirondack High Peaks and Champlain Valley. The trailhead is also a starting point for Nubble and Rocky Peak Ridge, making it a hub for challenging but spectacular day hikes.",
        "place_id": null,
        "place_query": "Chapel Pond Giant Mountain Ridge Trailhead Keene NY"
      },
      {
        "name": "St. Huberts Trailhead (AMR Lot)",
        "lat": 44.0931,
        "lng": -73.765,
        "location": "Rt 73, Ausable Club, Keene Valley, NY 12943",
        "region": "Adirondacks",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round (limited access rules)",
        "description": "The AMR/Ausable Club parking area giving access to trails to popular peaks like Noonmark, Dial, Nippletop, and the Great Range.",
        "full_description": "This heavily used trailhead provides access through the Adirondack Mountain Reserve to dozens of routes, including the Noonmark Mountain hike, the scenic Lake Road approach to Colvin, Blake, Dial, Nippletop, and trails into the Great Range. A permit system and access restrictions apply, but it remains one of the most important trailheads in the Adirondacks. The Noonmark hike (4.2 miles round trip) is especially popular with families seeking a manageable but scenic summit.",
        "place_id": null,
        "place_query": "St Huberts Trailhead Ausable Club Keene Valley NY"
      },
      {
        "name": "Saranac Lake 6er Trailhead (Baker Mountain)",
        "lat": 44.3131,
        "lng": -74.1286,
        "location": "Forest Hill Ave, Saranac Lake, NY 12983",
        "region": "Adirondacks",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead for Baker Mountain, the shortest of the Saranac Lake 6ers, popular for families and first-time climbers.",
        "full_description": "Located just outside downtown Saranac Lake, the Baker Mountain trailhead provides quick access to a 1.8-mile round trip climb. Despite its modest size, Baker's rocky summit offers great views of McKenzie Mountain and the village of Saranac Lake. It's a cornerstone of the Saranac Lake 6er challenge and ideal for families or those new to Adirondack hiking. Open year-round, Baker is especially popular for short sunrise or sunset hikes.",
        "place_id": null,
        "place_query": "Baker Mountain trailhead Saranac Lake NY"
      },
      {
        "name": "Goodnow Mountain Trailhead",
        "lat": 43.9733,
        "lng": -74.1353,
        "location": "Route 28N, Newcomb, NY 12852",
        "region": "Adirondacks",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "A well-maintained trail near Newcomb leading to a fire tower with sweeping High Peaks views.",
        "full_description": "This family-friendly trailhead starts a 1.9-mile climb up Goodnow Mountain, located near the SUNY ESF Visitor Interpretive Center in Newcomb. The summit fire tower provides a full panorama of the central Adirondacks, including the High Peaks to the north. The trail, managed by SUNY, is well-graded and suitable for kids, making it one of the best introductory fire tower hikes in the region.",
        "place_id": null,
        "place_query": "Goodnow Mountain trailhead Newcomb NY"
      },
      {
        "name": "Owls Head Mountain Trailhead (Long Lake)",
        "lat": 43.9718,
        "lng": -74.4215,
        "location": "Endion Rd, Long Lake, NY 12847",
        "region": "Adirondacks",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead near Long Lake leading to a 3.2-mile hike up to a fire tower with views of the High Peaks and the Adirondack interior.",
        "full_description": "Owls Head Mountain is a classic 3,150′ fire tower peak in Hamilton County. The 3.2-mile trail climbs gradually through forest before steepening near the summit. The restored fire tower provides 360° views over Long Lake, the High Peaks, and the Central Adirondacks. The trailhead has a small parking area and is used year-round, though best from spring to fall. It's one of the most rewarding moderate hikes in the Long Lake area.",
        "place_id": null,
        "place_query": "Owls Head Mountain trailhead Long Lake NY"
      },
      {
        "name": "Pharaoh Lake Wilderness Trailhead",
        "lat": 43.7406,
        "lng": -73.6233,
        "location": "Pharaoh Rd, Brant Lake, NY 12815",
        "region": "Adirondacks",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead into the Pharaoh Lake Wilderness, one of the largest roadless tracts in the Adirondacks, featuring a scenic lake and network of trails.",
        "full_description": "This official DEC parking area at the end of Pharaoh Road provides access into the Pharaoh Lake Wilderness, a 46,000-acre backcountry area east of Schroon Lake. A gentle 3-mile trail leads to Pharaoh Lake, one of the Adirondacks' largest wilderness lakes, with campsites, lean-tos, and mountain backdrops. From here, trails radiate out to summits like Pharaoh Mountain and Treadway Mountain. It's a quieter but beloved alternative to the High Peaks, offering solitude, swimming, and accessible wilderness for hikers and backpackers.",
        "place_id": null,
        "place_query": "Pharaoh Lake Wilderness trailhead Brant Lake NY"
      }
    ]
  },
  {
    "region": "Catskills",
    "trails": [
      {
        "name": "Slide Mountain Trailhead (Route 47)",
        "lat": 42.009,
        "lng": -74.4275,
        "location": "Slide Mountain Parking Area, CR-47, Shandaken, NY",
        "region": "Catskills",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Primary trailhead for the Catskills’ highest peak (4,180′ Slide Mountain), featuring a moderate 5.4-mile round-trip hike through forest to expansive summit views.",
        "full_description": "Located on Ulster County Route 47 (Frost Valley Rd), this DEC trailhead provides the easiest access to Slide Mountain via the red-blazed Wittenberg-Cornell-Slide Trail. The hike gains ~1,700′ over 2.7 miles one-way, passing the Burroughs memorial and leading to a large, flat summit clearing. As the Catskills’ tallest peak, Slide is a “must-hike” destination for many and anchors the famous Burroughs Range. The trail is well-marked and popular year-round (snowshoes required in winter), offering hikers dramatic viewpoints near the summit over the Catskill High Peaks.",
        "place_id": null,
        "place_query": "Slide Mountain Trailhead Big Indian NY"
      },
      {
        "name": "Giant Ledge & Panther Mountain Trailhead",
        "lat": 42.0265,
        "lng": -74.4035,
        "location": "Panther Mountain Parking, CR-47 (Oliverea Rd), Shandaken, NY",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Access point for one of the Catskills’ “most popular hiking trails,” leading to a series of five cliff ledges with breathtaking panoramas of the mountains.",
        "full_description": "Situated at a hairpin turn along CR-47 north of Slide Mtn, this trailhead (shared with Slide’s western approach) leads 1.5 miles to Giant Ledge and onward 1.7 miles to Panther Mtn (3,720′). Giant Ledge is renowned as “one of the most popular destinations in the Catskills” due to its string of open rock ledges yielding sweeping views of the Esopus Valley and high peaks like Slide and Cornell. The moderate hike (about 3.0 miles round-trip to visit all ledges) rewards even casual hikers with what many call the Catskills’ most spectacular scenic vista, especially during fall foliage. Limited roadside parking fills quickly on weekends, so arrive early.",
        "place_id": null,
        "place_query": "Giant Ledge trailhead Oliverea NY"
      },
      {
        "name": "Kaaterskill Falls Trailhead (Laurel House Road)",
        "lat": 42.1958,
        "lng": -74.0634,
        "location": "Laurel House Rd Parking, Haines Falls, NY 12436",
        "region": "Catskills",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Official upper trailhead to New York’s iconic two-tier waterfall (total drop 260′), with a short accessible path to a viewing platform and trails down to the falls’ base.",
        "full_description": "This DEC-maintained parking area in Kaaterskill Wild Forest allows safe access to Kaaterskill Falls, one of the tallest waterfalls in the East. A 0.3-mile gravel path leads to an observation deck overlooking the dramatic double cascades, and a staircase trail descends into the gorge to the middle and lower falls areas (open in season). Long a famous scenic spot since the 1800s, Kaaterskill Falls is extremely popular on summer and autumn weekends – hundreds of visitors hike in to experience its misty cool basin and the historic beauty immortalized by Hudson River School painters. The trailhead features signage and restrooms; note that trails can close in winter for safety.",
        "place_id": null,
        "place_query": "Kaaterskill Falls Laurel House Trailhead NY"
      },
      {
        "name": "Overlook Mountain Trailhead",
        "lat": 42.0711,
        "lng": -74.1226,
        "location": "335 Meads Mountain Rd, Woodstock, NY 12498",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Very popular trailhead in Woodstock leading up an old carriage road to a 3,140′ summit with a fire tower, panoramic Hudson Valley views, and intriguing hotel ruins.",
        "full_description": "Located across from the Tibetan monastery above Woodstock, this trailhead is the start of the 2.5-mile route up Overlook Mountain. Gaining ~1,400′ via steady switchbacks on a wide gravel path, hikers reach the summit area to find a steel fire lookout tower (with 360° vistas over the Catskills and Hudson River) and the remains of a 1920s mountain hotel. It’s “a very popular hike” due to the combination of moderate effort and big rewards – on a clear day you can see as far as the Hudson Highlands and Albany. The trailhead has a decent-sized lot that fills fast on weekends. Overlook is hiked in all seasons (microspikes recommended in winter) and is often one of the first Catskill peaks new hikers tackle for its famous sunrise and sunset views.",
        "place_id": null,
        "place_query": "Overlook Mountain Trailhead Woodstock NY"
      },
      {
        "name": "Hunter Mountain Trailhead (Becker Hollow)",
        "lat": 42.1818,
        "lng": -74.1969,
        "location": "Becker Hollow Rd, Hunter, NY 12442",
        "region": "Catskills",
        "difficulty_range": "Hard",
        "season": "Year-round",
        "description": "Steepest official route to Hunter Mountain, the Catskills' second highest peak, culminating at a fire tower with sweeping 360° views.",
        "full_description": "The Becker Hollow trailhead leads to a demanding 4.7-mile round trip climb up Hunter Mountain, gaining over 2,200 feet in less than 2.5 miles. It is considered the steepest official trail in the Catskills. The reward at the summit is a restored fire tower offering unmatched 360° panoramas across the Catskills and even to the Adirondacks on clear days. This trailhead is popular with peakbaggers and those completing the Catskill 3500 Club list, especially in winter when snowshoeing is required.",
        "place_id": null,
        "place_query": "Hunter Mountain Becker Hollow trailhead NY"
      },
      {
        "name": "Windham High Peak Trailhead (Elm Ridge)",
        "lat": 42.3087,
        "lng": -74.2202,
        "location": "NY-23, East Windham, NY 12496",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Access point for a moderate hike to Windham High Peak, one of the Catskills' 35 highest, with excellent views toward the Hudson Valley.",
        "full_description": "Located near the Elm Ridge parking area on Route 23, this trailhead provides a 6.6-mile round trip hike up Windham High Peak (3,524′). The climb is gradual and suitable for families with older kids. The summit offers panoramic views east toward the Hudson Valley and west toward the Devil's Path range. As one of the easier Catskill High Peaks, it is a popular choice for hikers seeking a manageable but rewarding summit experience, accessible in all seasons.",
        "place_id": null,
        "place_query": "Windham High Peak trailhead NY"
      },
      {
        "name": "Wittenberg Mountain Trailhead (Woodland Valley)",
        "lat": 42.0215,
        "lng": -74.3575,
        "location": "Woodland Valley Campground, Phoenicia, NY 12464",
        "region": "Catskills",
        "difficulty_range": "Hard",
        "season": "Spring–Fall (campground road closes in winter)",
        "description": "Trailhead in Woodland Valley giving access to Wittenberg and Cornell Mountains, with one of the Catskills' most celebrated vistas.",
        "full_description": "This DEC-managed trailhead begins from the Woodland Valley Campground area. The red-blazed Wittenberg-Cornell-Slide Trail climbs 3.9 miles to Wittenberg Mountain, one of the most iconic summits in the Catskills. The open ledge at Wittenberg offers breathtaking views over Ashokan Reservoir and the southern Catskills, considered among the best vistas in the range. Continuing on, experienced hikers can add Cornell or Slide to form a rugged traverse. Parking fills quickly on summer weekends, and access may be limited when the campground gate is closed in winter.",
        "place_id": null,
        "place_query": "Wittenberg Mountain Woodland Valley trailhead NY"
      },
      {
        "name": "North-South Lake Campground Trailheads",
        "lat": 42.2007,
        "lng": -74.0519,
        "location": "874 North Lake Rd, Haines Falls, NY 12436",
        "region": "Catskills",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Multiple trailheads around North-South Lake giving access to family-friendly loops and the Escarpment Trail's dramatic clifftop views.",
        "full_description": "North-South Lake Campground is the Catskills' largest state campground, and its network of official trailheads provides access to the Escarpment Trail and several historic ledges. Popular destinations include Artist's Rock, Sunset Rock, and the former site of the Catskill Mountain House. Most hikes here are 2–4 miles and easy to moderate, making them highly family-friendly. The overlooks provide dramatic views over the Hudson Valley, and the trails are dotted with historical markers highlighting the Hudson River School of painting. The trails are open spring through fall when the campground is in operation.",
        "place_id": null,
        "place_query": "North South Lake Escarpment trailhead Haines Falls NY"
      },
      {
        "name": "Blackhead Range Trailhead (Big Hollow Rd)",
        "lat": 42.2909,
        "lng": -74.1112,
        "location": "Big Hollow Rd, Maplecrest, NY 12454",
        "region": "Catskills",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Trailhead for the Blackhead Range, accessing Blackhead, Black Dome, and Thomas Cole Mountains via steep climbs and rugged terrain.",
        "full_description": "This DEC trailhead at the end of Big Hollow Road is the gateway to the Blackhead Range, including Blackhead (3,940′), Black Dome, and Thomas Cole Mountains. The hikes here are steep and rugged, with ascents of over 2,000 feet, but the summits reward hikers with excellent views of the northern Catskills. This area is less crowded than Slide or Hunter but is a must for Catskill 3500 Club aspirants. Trails are accessible year-round, though winter conditions can be harsh.",
        "place_id": null,
        "place_query": "Blackhead Range trailhead Big Hollow Rd NY"
      },
      {
        "name": "Balsam Lake Mountain Trailhead",
        "lat": 42.0802,
        "lng": -74.5855,
        "location": "Beaverkill Rd, Hardenburgh, NY 12465",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Remote trailhead leading to Balsam Lake Mountain, the site of the Catskills' first fire tower, with broad summit views.",
        "full_description": "The Balsam Lake Mountain trailhead, located near the Beaverkill valley, provides a 3.6-mile round trip hike to the 3,720′ summit. The restored fire tower at the top offers sweeping 360° views of the western Catskills. It's considered one of the easier Catskill 3500 peaks, making it popular for families and history buffs alike. Accessible in all seasons, though the road may be challenging in winter.",
        "place_id": null,
        "place_query": "Balsam Lake Mountain trailhead Hardenburgh NY"
      },
      {
        "name": "Sam's Point Preserve (Minnewaska)",
        "lat": 41.67015,
        "lng": -74.36167,
        "location": "400 Sam's Point Road, Cragsmoor, Ulster County",
        "region": "Catskills",
        "difficulty_range": "Moderate–Hard",
        "season": "Spring–Fall (reservations Apr–Oct weekends)",
        "description": "Unique ridgetop hike featuring ice caves, cliff views, and a 180-foot waterfall.",
        "full_description": "Sam's Point offers a remarkable 7.5-mile out-and-back hike through rare Shawangunk ridge terrain, with dramatic western vistas, the 180-foot Verkeerderkill Falls, rock scrambles and even hidden ice caves…",
        "place_query": "Sam's Point Preserve Parking Area"
      },
      {
        "name": "Ashokan Rail Trail (Ashokan Station)",
        "lat": 41.97279,
        "lng": -74.19879,
        "location": "3045 NY-28, Shokan, Ulster County",
        "region": "Catskills",
        "difficulty_range": "Easy",
        "season": "Year-round (dawn to dusk)",
        "description": "An 11.5-mile accessible rail-trail along the Ashokan Reservoir, ideal for walking and biking.",
        "full_description": "The Ashokan Rail Trail (ART) is a flat 11.5-mile path that opened in 2019 along the northern edge of the Ashokan Reservoir. Its 10–12 foot wide crushed-stone surface is ADA-friendly…",
        "place_query": "Ashokan Rail Trail Ashokan Station Trailhead"
      },
      {
        "name": "Ashokan High Point (Peekamoose Road)",
        "lat": 41.935832,
        "lng": -74.327768,
        "location": "Kanape Brook Trailhead, 4 mi south of West Shokan (Ulster County)",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Forest trail to a 3,086′ summit with rewarding views of the Ashokan Reservoir.",
        "full_description": "This popular hike follows the Kanape Brook trail in Sundown Wild Forest to the summit of Ashokan High Point (3,086′). Easy brook-side start, then a steeper ~1,800′ climb to ridge views…",
        "place_query": "Kanape Brook Trailhead Ashokan High Point"
      },
      {
        "name": "Mount Tremper (Old Route 28)",
        "lat": 42.070583,
        "lng": -74.302233,
        "location": "Trailhead on County Route 40 (Old Rt 28), Phoenicia, Ulster County",
        "region": "Catskills",
        "difficulty_range": "Hard",
        "season": "Year-round",
        "description": "Steep 6-mile hike to a fire tower with panoramic Catskill Mountain views.",
        "full_description": "Though only 2,740′, Mount Tremper is a demanding ~6-mile, ~2,000′-gain climb on a rocky, relentlessly uphill trail. The summit fire tower delivers 360° views of the Burroughs Range…",
        "place_query": "Mount Tremper Fire Tower Trailhead Phoenicia"
      },
      {
        "name": "Indian Head & Twin (Prediger Road)",
        "lat": 42.13407,
        "lng": -74.10407,
        "location": "End of Prediger Road, off Platte Clove Rd (Elka Park, Greene County)",
        "region": "Catskills",
        "difficulty_range": "Hard",
        "season": "Year-round",
        "description": "Eastern Devil's Path trailhead leading to steep scrambles and epic views on Indian Head and Twin.",
        "full_description": "Prediger Road is the eastern gateway to the Devil's Path. From here, strong hikers tackle Indian Head (3,573′) and Twin (3,652′) via a rugged loop with hands-and-feet scrambles and big ledge vistas…",
        "place_query": "Prediger Road Trailhead Devils Path"
      },
      {
        "name": "West Kill Mountain (Spruceton Road)",
        "lat": 42.1824,
        "lng": -74.2695,
        "location": "DEC Trailhead at end of Spruceton Rd (County Route 6), Town of Hunter, Greene County",
        "region": "Catskills",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Access point for West Kill Mountain (via Diamond Notch Falls) and Hunter's western trail.",
        "full_description": "At the head of Spruceton Valley, this large lot serves West Kill's scenic route (Diamond Notch Falls, steady climb to Buck Ridge Lookout) and the blue-marked western approach to Hunter Mountain…",
        "place_query": "Spruceton Road trailhead West Kill"
      },
      {
        "name": "Frick Pond Loop (Beech Mountain Rd)",
        "lat": 41.951114,
        "lng": -74.706984,
        "location": "Beech Mountain Road, Willowemoc Wild Forest (near DeBruce, Sullivan County)",
        "region": "Catskills",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "A gentle 2.2-mile nature loop around a quiet pond, with boardwalks through wetlands.",
        "full_description": "Short, family-friendly loop through forest and meadow around Frick Pond, with boardwalks over wet sections; great birding, mellow grades, and good winter snowshoeing…",
        "place_query": "Frick Pond Trailhead Beech Mountain Road"
      },
      {
        "name": "Bramley Mountain (Glen Burnie Rd)",
        "lat": 42.2993,
        "lng": -74.836,
        "location": "3276 Glen Burnie Road, Town of Delhi, Delaware County",
        "region": "Catskills",
        "difficulty_range": "Moderate",
        "season": "Year-round (best Spring–Fall)",
        "description": "4-mile loop to a 2,817′ summit with a newly rebuilt fire tower, quarry ruins, and big views.",
        "full_description": "A Catskill Mountain Club trail visiting a bluestone quarry, cliffs/caves, and a summit now crowned by a returned fire tower with sweeping views toward Pepacton and Pisgah…",
        "place_query": "Bramley Mountain Trailhead Delhi NY"
      }
    ]
  },
  {
    "region": "Finger Lakes",
    "trails": [
      {
        "name": "Watkins Glen State Park (Main Entrance)",
        "lat": 42.3672,
        "lng": -76.9019,
        "location": "1009 N Franklin St, Watkins Glen, NY 14891",
        "region": "Finger Lakes",
        "difficulty_range": "Moderate",
        "season": "Spring–Fall",
        "description": "Main gateway to a world-famous gorge trail that winds 2 miles past 19 waterfalls through 400-foot cliffs of Watkins Glen, the most visited state park in the US.",
        "full_description": "From this entrance in downtown Watkins Glen, hikers immediately enter a surreal narrow canyon where Glen Creek descends 400 feet in 2 miles, creating 19 waterfalls that you hike “past, behind, and even under” via stone bridges and tunnels. The Gorge Trail’s 800+ stone steps lead you through highlights like Rainbow Falls (where sunlight often creates rainbows in the mist) and Cavern Cascade, making Watkins Glen State Park an absolute must-see. The trail is well-maintained with railings and opens seasonally (generally May–October). As Google Maps data confirmed, this park is incredibly popular – it topped the 2025 list of most-visited state parks in America – so expect crowds, especially in summer.",
        "place_id": null,
        "place_query": "Watkins Glen State Park Main Entrance NY"
      },
      {
        "name": "Taughannock Falls State Park (Gorge Trail)",
        "lat": 42.545,
        "lng": -76.606,
        "location": "1740 Taughannock Blvd, Trumansburg, NY 14886",
        "region": "Finger Lakes",
        "difficulty_range": "Easy",
        "season": "Year-round",
        "description": "Trailhead for an easy 0.75-mile path leading to the base of 215-foot Taughannock Falls – the tallest single-drop waterfall in the Eastern U.S., even taller than Niagara.",
        "full_description": "Located off NY Route 89 near Cayuga Lake, this access point leads along Taughannock Creek to an amphitheater-like gorge housing the 215′ Taughannock Falls. The level gravel trail (1.5 miles round-trip) is family-friendly and ends at a viewing area where visitors can fully appreciate this waterfall, which “is the tallest single-drop waterfall east of the Mississippi River – even taller than Niagara Falls”. Sheer shale cliffs over 300′ high frame the falls, and peregrine falcons are often seen circling above. The state park also offers an upper overlook and rim trails, but the gorge trail is the most direct way to feel the spray of Taughannock’s plunge up close. It’s a year-round destination (stunning with winter ice buildup) with restrooms and parking at the start.",
        "place_id": null,
        "place_query": "Taughannock Falls trailhead Trumansburg NY"
      },
      {
        "name": "Robert H. Treman State Park (Upper Gorge Trail)",
        "lat": 42.4026,
        "lng": -76.5481,
        "location": "105 Enfield Falls Rd, Ithaca, NY 14850",
        "region": "Finger Lakes",
        "difficulty_range": "Moderate",
        "season": "Spring–Fall",
        "description": "Scenic trailhead in Enfield Glen leading to 12 waterfalls including the 115′ Lucifer Falls, via a rugged loop through a craggy gorge with stone bridges and ladders.",
        "full_description": "This trailhead in the upper section of Robert H. Treman State Park begins the Gorge Trail, which winds along Enfield Creek past multiple cascades and pools. Hikers will encounter “winding trails (and) 12 waterfalls, including the 115-foot Lucifer Falls” viewpoint, where you can gaze 1.5 miles down the wooded gorge. The trail features beautifully crafted stone steps and bridges from CCC-era work, making the loop with the Rim Trail a favorite. Rated moderate for some steep segments and over 4 miles round-trip, this hike offers a mix of close-up waterfall action and panoramic overlooks into Enfield Glen. Amenities like picnic areas and a swimming area (at Lower Falls) are in the lower park, but the upper gorge trailhead is the starting point for Treman’s most dramatic scenery.",
        "place_id": null,
        "place_query": "Robert Treman State Park Upper Gorge Trail Ithaca NY"
      },
      {
        "name": "Chimney Bluffs State Park",
        "lat": 43.2889,
        "lng": -76.9111,
        "location": "7700 Garner Rd, Wolcott, NY 14590",
        "region": "Finger Lakes",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Lakeshore trailhead showcasing massive clay spires (“chimneys”) along Lake Ontario – arguably “the most dramatic landscape on the Lake Ontario shore” with several miles of bluff-top trails.",
        "full_description": "At this park on Sodus Bay, a network of easy trails departs the parking area to traverse above and below towering eroded drumlin cliffs. The Bluff Trail runs along the edge of the cliffs, giving hikers stunning views of the sharp pinnacles and the lake. Chimney Bluffs’ bizarre formations – giant earthen spires formed by wind and wave erosion – make it a unique hiking destination. The area is not strenuous (several short interconnecting trails, some steep sections) and is open year-round. It’s a popular spot for photography and sunsets, and as the NY Parks description notes, “Chimney Bluffs features the most dramatic landscape on the Lake Ontario shore,” a truly one-of-a-kind experience in the Finger Lakes region.",
        "place_id": null,
        "place_query": "Chimney Bluffs State Park trailhead NY"
      },
      {
        "name": "Buttermilk Falls State Park (Main Entrance)",
        "lat": 42.4177,
        "lng": -76.5234,
        "location": "112 E Buttermilk Falls Rd, Ithaca, NY 14850",
        "region": "Finger Lakes",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead for the Gorge and Rim Trails, passing a dramatic series of cascades culminating in the 165′ Buttermilk Falls.",
        "full_description": "This popular state park in Ithaca begins right at the parking lot, where Buttermilk Falls tumbles 165 feet into a swimming hole. The Gorge Trail climbs alongside Buttermilk Creek, crossing stone bridges and staircases past a series of smaller cascades, while the Rim Trail offers a quieter return loop through forest. The trails total about 1.5 miles and are suitable for families, though the stairs can be steep. The gorge trails are open seasonally (spring–fall), while the upper park offers picnic areas and additional hiking loops.",
        "place_id": null,
        "place_query": "Buttermilk Falls State Park trailhead Ithaca NY"
      },
      {
        "name": "Fillmore Glen State Park",
        "lat": 42.7379,
        "lng": -76.3965,
        "location": "1686 NY-38, Moravia, NY 13118",
        "region": "Finger Lakes",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead for gorge paths that follow cascading Glen Creek past multiple waterfalls in a quiet, less-crowded Finger Lakes gorge.",
        "full_description": "Fillmore Glen, near Moravia, is one of the lesser-known but most beautiful Finger Lakes gorge parks. From the main entrance, trails lead into a narrow glen filled with mossy stone, ferns, and five waterfalls. The Gorge Trail is about 2 miles round trip, with stone stairways and footbridges crossing Glen Creek. Highlights include Cowsheds Falls, a picturesque curtain waterfall. Trails are open seasonally (usually May–October), and the park is named after President Millard Fillmore, who was born nearby.",
        "place_id": null,
        "place_query": "Fillmore Glen State Park trailhead Moravia NY"
      },
      {
        "name": "Cascadilla Gorge Trail",
        "lat": 42.4407,
        "lng": -76.484,
        "location": "College Ave & Court St, Ithaca, NY 14850",
        "region": "Finger Lakes",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Scenic stone stairway trail connecting downtown Ithaca to Cornell University via a gorge with eight waterfalls.",
        "full_description": "This urban gorge trail begins near downtown Ithaca and climbs 0.6 miles to Cornell's campus along Cascadilla Creek. The stone path, maintained with stairways and bridges, passes eight waterfalls ranging from 8 to 80 feet tall. Though short, the trail is steep with over 400 stone steps, making it a fun workout and a dramatic walk to campus. It is open seasonally due to icy conditions in winter and is one of the most popular short gorge hikes in Ithaca.",
        "place_id": null,
        "place_query": "Cascadilla Gorge trailhead Ithaca NY"
      }
    ]
  },
  {
    "region": "Western NY",
    "trails": [
      {
        "name": "Letchworth State Park (Middle/Upper Falls area)",
        "lat": 42.570148,
        "lng": -78.05117,
        "location": "Falls Area Parking, Park Rd near Glen Iris Inn, Castile, NY 14427",
        "region": "Western NY",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Major trailhead in “the Grand Canyon of the East,” providing easy access to viewing areas for three massive waterfalls on the Genesee River amid 600-foot cliffs and lush forests.",
        "full_description": "This central Letchworth trailhead by the historic Glen Iris Inn puts visitors steps away from the park’s star attractions: the Middle Falls (107′ tall, widest and illuminated at night) and Upper Falls (70′, with a scenic railroad trestle above). A level paved path connects overlooks of these falls, suitable for all ages. Longer hiking trails (like the 7-mile Gorge Trail) also depart here for those wanting to explore further. Letchworth is renowned as one of America’s most scenic parks – “the Genesee River roars through the gorge over three major waterfalls between cliffs as high as 600 feet, surrounded by lush forests”. This trailhead offers restrooms, picnic spots, and some of the best viewpoints in a park that won the USA Today “Best State Park” award in 2015.",
        "place_id": null,
        "place_query": "Letchworth State Park Falls Area Castile NY"
      },
      {
        "name": "Devil’s Hole Trailhead (Niagara Gorge)",
        "lat": 43.133179,
        "lng": -79.046173,
        "location": "Devil’s Hole State Park, Niagara Scenic Pkwy, Niagara Falls, NY 14305",
        "region": "Western NY",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Rim and gorge trailhead overlooking the Niagara River’s Devil’s Hole Rapids; a stone stairway drops into the gorge, offering “spectacular views of the rapids and gorge rock layers”.",
        "full_description": "This trailhead at Devil’s Hole State Park begins near scenic overlooks of the class V rapids, then descends a long stone staircase deep into the Niagara Gorge. Hikers can follow the Devil’s Hole Trail downstream along the river’s edge, where the rushing water and 400-million-year-old rock strata are up close. It’s one of the most popular hiking routes in the Niagara area – “an up-close, spectacular view of the gorge’s rapids” and a shady, rugged path frequented by anglers and hikers alike. The climb back up is strenuous (more than 400 steps), but the experience of walking within the mighty Niagara Gorge is unforgettable. The trail connects north to Whirlpool State Park, and the entire area is open year-round (use caution in winter).",
        "place_id": null,
        "place_query": "Devil's Hole State Park trail Niagara Falls NY"
      },
      {
        "name": "Eternal Flame Falls Trailhead (Chestnut Ridge Park)",
        "lat": 42.702934,
        "lng": -78.747677,
        "location": "6130 Seufert Rd, Orchard Park, NY 14127",
        "region": "Western NY",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Woodland trailhead leading to a 25-foot waterfall with a natural gas “eternal flame” burning behind it – a unique hidden gem hike in suburban Buffalo.",
        "full_description": "This unassuming trailhead in a county park yields one of NY’s most curious sights. A 0.6-mile creekside trail (can be muddy and slippery) brings hikers to a shale waterfall that shelters a flickering natural gas flame right behind the water. The short hike is moderately challenging only for a few steep banks and stair steps, but it’s popular for families and photographers seeking the “eternal flame” phenomenon. The flame, fed by a natural gas seep in the rock, can be relit if extinguished and typically burns year-round. Hikers should wear good footwear and be prepared for a brief scramble to reach the falls alcove. This trail is on the outskirts of Chestnut Ridge Park and has become a viral attraction in recent years – expect some crowds on fair-weather weekends.",
        "place_id": null,
        "place_query": "Eternal Flame Falls trailhead Orchard Park NY"
      },
      {
        "name": "Zoar Valley Multiple Use Area Trailhead",
        "lat": 42.4845,
        "lng": -78.915,
        "location": "Zoar Valley Rd, Gowanda, NY 14070",
        "region": "Western NY",
        "difficulty_range": "Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead into the wild Zoar Valley gorge, known for towering cliffs, waterfalls, and old-growth forest.",
        "full_description": "The Zoar Valley trailhead gives access to one of the most scenic and ecologically rich areas in Western New York. Trails descend into a deep gorge carved by Cattaraugus Creek, where 400-foot cliffs rise above the river. Visitors can explore waterfalls, giant sycamores, and some of the state's oldest trees. The area is rugged and requires care, but it is beloved by experienced hikers seeking wild beauty. Best visited spring through fall; sections may close in winter for safety.",
        "place_id": null,
        "place_query": "Zoar Valley trailhead Gowanda NY"
      },
      {
        "name": "Allegany State Park (Quaker Area Trailhead)",
        "lat": 42.0626,
        "lng": -78.7601,
        "location": "2373 ASP Route 1, Salamanca, NY 14779",
        "region": "Western NY",
        "difficulty_range": "Easy–Hard",
        "season": "Year-round",
        "description": "Trailhead hub in Allegany State Park's Quaker Area, giving access to miles of forest trails, fire towers, and lake loops.",
        "full_description": "Allegany State Park, the largest state park in New York, offers more than 65,000 acres of forest and trails. The Quaker Area trailheads serve popular hikes like Bear Caves, Mount Tuscarora, and the Quaker Lake loop. Trails range from easy lake walks to strenuous climbs with views across the Allegheny Plateau. The park is open year-round, with hiking in summer and snowshoeing and skiing in winter.",
        "place_id": null,
        "place_query": "Allegany State Park Quaker Area trailhead NY"
      }
    ]
  },
  {
    "region": "Hudson Valley",
    "trails": [
      {
        "name": "Breakneck Ridge Trailhead",
        "lat": 41.4597,
        "lng": -73.9589,
        "location": "Route 9D (at Breakneck Tunnel), Beacon, NY 12508",
        "region": "Hudson Valley",
        "difficulty_range": "Hard",
        "season": "Year-round",
        "description": "Infamous trailhead for a steep rock-scramble route up Breakneck Ridge – widely considered “the most popular hike in the lower Hudson Valley,” known for its challenge and stunning river views.",
        "full_description": "This roadside trailhead north of Cold Spring marks the start of Breakneck Ridge’s white-blazed ascent – a near-vertical scramble up open rock pitches with constant vistas. The route gains about 1,250′ in just 0.75 miles, making it a short but very strenuous hike that draws huge crowds (particularly on weekends via Metro-North). Breakneck’s popularity is legendary – it’s “extremely popular” and often listed among the Northeast’s top day hikes. Hikers who conquer the initial scrambles are rewarded with panoramic overlooks of the Hudson River and Storm King Mountain at multiple ledges. The trail continues along ridges and can be turned into a longer loop, but most people turnaround after the first three lookout summits. Use caution; the trail is steep and rugged (hence the name), but it remains a rite-of-passage hike for New Yorkers.",
        "place_id": null,
        "place_query": "Breakneck Ridge trailhead Cold Spring NY"
      },
      {
        "name": "Mount Beacon Trailhead",
        "lat": 41.504,
        "lng": -73.959,
        "location": "788 Wolcott Ave (Route 9D), Beacon, NY 12508",
        "region": "Hudson Valley",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Busy trailhead at the base of Mt. Beacon, leading up a former incline railway route to South Beacon’s fire tower – a “very popular trail” offering a big workout and grand Hudson Highlands views.",
        "full_description": "This Scenic Hudson trailhead at the foot of Beacon Mountain grants access to the highest summit in the Hudson Highlands (1,595′). The well-trodden trail follows remnants of the old casino-incline railway, climbing via steep gravel switchbacks. After 2 miles and ~1,400′ ascent, hikers reach the South Beacon Fire Tower, which provides a 360° panorama from the Catskills to Manhattan on clear days. The trek also passes ruins of the 1900s summit hotel and offers an overlook at the site of the upper tram station. “Mount Beacon is a very popular trail… for good reason,” noted for its workout and views, so the parking lot overflows on nice days. An alternate longer loop via old carriage roads is available, but most stick to the main out-and-back. The trail is open year-round (popular for sunrise hikes).",
        "place_id": null,
        "place_query": "Mount Beacon Fire Tower Trailhead NY"
      },
      {
        "name": "Sam’s Point Preserve Trailhead",
        "lat": 41.6729,
        "lng": -74.354,
        "location": "400 Sam’s Point Rd, Cragsmoor, NY 12420",
        "region": "Hudson Valley",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead on the Shawangunk Ridge accessing Sam’s Point – a sky lake, sweeping Shawangunk vista, Ice Caves, and waterfall – truly “one of the most remarkable hiking adventures in the Catskills (Gunks)”.",
        "full_description": "Part of Minnewaska State Park, this preserve trailhead (reservation required in peak season) leads to the unique high-altitude Sam’s Point area. A 5-mile loop hits highlights including the Sam’s Point overlook (atop exposed white conglomerate cliffs with a 270° view), the hidden Ice Caves (deep crevices that retain ice into summer), and the 187′ Verkeerderkill Falls accessed by a spur trail. The terrain is a mix of carriage road and narrow trails through dwarf pine barrens. While a bit out of the way, Sam’s Point is a “must-see destination” for its combination of vistas, rare geology, and features like walking through ice-filled caves. The trailhead has a visitor center and facilities. Be prepared for variable conditions – the ice caves are 45°F even on hot days and portions of the trail can be wet. Sam’s Point offers an unforgettable experience unlike any other in the region.",
        "place_id": null,
        "place_query": "Sams Point Preserve trailhead Cragsmoor NY"
      },
      {
        "name": "Storm King Mountain Trailhead",
        "lat": 41.425,
        "lng": -74.006,
        "location": "Parking Area, 9W northbound, Cornwall-On-Hudson, NY 12520",
        "region": "Hudson Valley",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Popular trailhead for a short, steep loop up Storm King Mountain, featuring multiple panoramic overlooks of the Hudson River and surrounding peaks from its rocky knolls.",
        "full_description": "Right off Route 9W, this trailhead serves hikes of 2.5–3.5 miles on Storm King’s slopes. The typical loop climbs quickly via switchbacks and rock steps to exposed ledges that offer “fantastic (possibly the best) overlooks of the Hudson River” at various points. Hikers can gaze straight down at the river’s bend by Crow’s Nest and across to Breakneck Ridge and Bannerman’s Castle. The name “Storm King” suits the often windy, dramatic vistas. Trails are well-marked (maintained by NY-NJ Trail Conference) and include some rock scrambles but are generally family-friendly for active kids. Because of the relatively short distance and big payoff, Storm King is “a very popular hike” albeit typically less crowded than Breakneck, with more parking available. It’s open year-round (excellent for fall foliage viewing).",
        "place_id": null,
        "place_query": "Storm King Mountain trailhead Cornwall NY"
      },
      {
        "name": "Bear Mountain State Park Trailhead (Major Welch Trail)",
        "lat": 41.3128,
        "lng": -74.0058,
        "location": "3006 Seven Lakes Dr, Bear Mountain, NY 10911",
        "region": "Hudson Valley",
        "difficulty_range": "Moderate–Hard",
        "season": "Year-round",
        "description": "Trailhead for the Major Welch Trail, a steep loop to Bear Mountain's summit with sweeping Hudson River views.",
        "full_description": "Bear Mountain is one of the most iconic hikes in the Hudson Valley, with the Major Welch Trail offering a challenging rock-scramble ascent to the summit. The loop is 4 miles round trip and rewards hikers with panoramic views of the Hudson River, Perkins Memorial Tower, and nearby peaks. It's especially popular in fall foliage season. Families often combine this with a visit to the Bear Mountain Zoo or carousel. The trail is open year-round, though icy conditions make winter ascents demanding.",
        "place_id": null,
        "place_query": "Bear Mountain Major Welch trailhead NY"
      },
      {
        "name": "Anthony's Nose Trailhead",
        "lat": 41.3229,
        "lng": -73.9753,
        "location": "US-9D, Cortlandt Manor, NY 10567",
        "region": "Hudson Valley",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead for a short but steep climb to Anthony's Nose, one of the most famous viewpoints over the Hudson River and Bear Mountain Bridge.",
        "full_description": "The Anthony's Nose trail begins from a roadside lot on Route 9D and ascends 1.5 miles to a rocky overlook perched high above the Hudson River. From the summit, hikers enjoy postcard views of the Bear Mountain Bridge, Hudson Highlands, and river valley. Despite its short length, the steep rocky sections give it a moderate rating. It is one of the most popular short hikes in the Hudson Valley, especially for sunrise and sunset.",
        "place_id": null,
        "place_query": "Anthony's Nose trailhead Hudson Valley NY"
      },
      {
        "name": "Minnewaska State Park (Lake Minnewaska Carriage Road Trailhead)",
        "lat": 41.7275,
        "lng": -74.2651,
        "location": "5281 Route 44-55, Kerhonkson, NY 12446",
        "region": "Hudson Valley",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead for carriage road loops around Lake Minnewaska with dramatic cliffs and Shawangunk views.",
        "full_description": "Minnewaska State Park Preserve is a premier Hudson Valley destination, offering dozens of miles of wide, family-friendly carriage roads. The main trailhead at Lake Minnewaska provides easy access to a 2-mile loop around the cliff-rimmed lake, as well as longer routes to Awosting Falls and Gertrude's Nose. The setting is striking, with white cliffs, dwarf pine barrens, and sweeping views. Open year-round, it's popular for hiking, biking, and cross-country skiing.",
        "place_id": null,
        "place_query": "Lake Minnewaska trailhead Kerhonkson NY"
      }
    ]
  },
  {
    "region": "Capital Region",
    "trails": [
      {
        "name": "John Boyd Thacher State Park (Indian Ladder Trail)",
        "lat": 42.6551,
        "lng": -74.018,
        "location": "830 Thacher Park Rd, Voorheesville, NY 12186",
        "region": "Capital Region",
        "difficulty_range": "Easy",
        "season": "May–Nov",
        "description": "Trailhead atop the Helderberg Escarpment leading to the famous Indian Ladder Trail – a short cliff-base walk under 150-foot limestone cliffs with waterfalls and valley panoramas.",
        "full_description": "This state park overlook area provides access to a set of stairs that descend to the Indian Ladder Trail, a historic path used for centuries. The 0.9-mile trail runs “beneath dramatic cliffs, with waterfalls, fossils, and big valley views” along the way. Hikers pass behind two waterfalls (in season) and along a ledge with railings at the foot of the sheer 100–200′ tall limestone cliff face. The trail, open roughly May through November, is relatively easy but can be wet and slippery (it is closed in winter for safety). Thacher Park’s trailhead area has a panoramic lookout over the Hudson-Mohawk valleys and Adirondacks on clear days. This easy adventure – “a relatively easy hike with a massive payoff” near Albany – is extremely popular with Capital Region families and tourists.",
        "place_id": null,
        "place_query": "Thacher Park Indian Ladder Trail Voorheesville NY"
      },
      {
        "name": "Peebles Island State Park",
        "lat": 42.7843,
        "lng": -73.6802,
        "location": "1 Delaware Ave North, Cohoes, NY 12047",
        "region": "Capital Region",
        "difficulty_range": "Easy",
        "season": "Year-round",
        "description": "Scenic loop trailhead on an island at the confluence of the Mohawk and Hudson Rivers – a “picturesque park” known for gentle forest paths with views of waterfalls, rapids, and historic canals.",
        "full_description": "This trailhead on Peebles Island (a 190-acre park) invites visitors to a flat 2-mile Perimeter Trail that circles the island’s bluff edges. The path offers continuous views of the water – from the rushing Mohawk River cascades at Cohoes Falls and below the cliffs, to the wide Hudson River on the east side. Interpretive signs highlight the island’s Revolutionary War-era history and its 19th-century canal remnants. It’s a tranquil, dog-friendly hike suitable for all ages, with abundant wildlife (deer and bald eagles are common). Situated where “the Mohawk and Hudson rivers” meet, Peebles Island provides a unique blend of nature and history just north of Albany. It is popular for picnicking and jogging as well, open year-round (beautiful when spring floodwaters rage or autumn leaves color the banks).",
        "place_id": null,
        "place_query": "Peebles Island State Park trail Waterford NY"
      }
    ]
  },
  {
    "region": "Central NY",
    "trails": [
      {
        "name": "Green Lakes State Park",
        "lat": 43.049,
        "lng": -75.973,
        "location": "7900 Green Lakes Rd, Fayetteville, NY 13066",
        "region": "Central NY",
        "difficulty_range": "Easy",
        "season": "Year-round",
        "description": "Trailhead for lakeside paths around two rare meromictic lakes (Green and Round Lakes) – known for their striking turquoise color and old-growth forest setting.",
        "full_description": "From the beach area trailhead, an easy level trail encircles Green Lake (1.8 miles) and connects to Round Lake’s loop, offering close views of the clear blue-green water. These glacial lakes do not mix layers (meromictic), resulting in unusual clarity and color. The surrounding park features 10+ miles of trails through rolling woods, including a portion of old-growth forest with 300-year-old trees. Green Lakes is very popular with walkers, joggers, and families – the main Lakes Trail is stroller-friendly and wildlife such as beavers and herons are often spotted. In summer, you can swim at the sandy beach (but not in the lakes outside the beach). With its “two glacial lakes surrounded by upland forest” and year-round accessibility, Green Lakes State Park is a beloved natural oasis just east of Syracuse.",
        "place_id": null,
        "place_query": "Green Lakes State Park trail Fayetteville NY"
      },
      {
        "name": "Chittenango Falls State Park",
        "lat": 42.9784,
        "lng": -75.8369,
        "location": "2300 Rathbun Rd, Cazenovia, NY 13035",
        "region": "Central NY",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead at a 167′ waterfall on Chittenango Creek, with a short steep trail and stairs leading from the upper falls overlook to the base of the gorge amidst lush forests.",
        "full_description": "This small state park offers a quick but impressive nature hike. From the parking area, a brief walk leads to an upper viewing railing for Chittenango Falls, which plunges in multiple tiers over a broad limestone ledge. A marked trail (with stairs and some rough sections) then descends one side of the gorge to a footbridge at the bottom of the falls, allowing for a misty up-close perspective. The entire loop is under 0.5 miles but involves about 170 feet of elevation change via stone steps. Chittenango Falls’ scenic beauty and easy access (just off US-20) make it a very popular picnic and photography spot in Central NY. The park is open year-round (the falls partially ice over in winter), though the gorge trail may close in icy conditions. Interpretive signs explain the geology of the 400-million-year-old rocks over which the waterfall flows.",
        "place_id": null,
        "place_query": "Chittenango Falls State Park trail Cazenovia NY"
      },
      {
        "name": "Clark Reservation State Park",
        "lat": 42.9981,
        "lng": -76.0827,
        "location": "6105 E Seneca Turnpike, Jamesville, NY 13078",
        "region": "Central NY",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead around a glacial lake surrounded by limestone cliffs, with diverse trails and a scenic overlook.",
        "full_description": "Clark Reservation, just south of Syracuse, features a dramatic glacial plunge basin lake bordered by cliffs and forest. From the main parking area, trails range from easy lake loops to rocky cliffside scrambles. The Long Trail provides a dramatic overlook of the lake and valley, while shorter paths allow for family-friendly walks. Open year-round, it's especially popular for spring wildflowers and fall foliage. Interpretive signage explains the rare geology and ecosystems preserved in the park.",
        "place_id": null,
        "place_query": "Clark Reservation State Park trailhead Jamesville NY"
      },
      {
        "name": "Highland Forest (Skyline Trailhead)",
        "lat": 42.8657,
        "lng": -75.9711,
        "location": "1254 Highland Park Rd, Fabius, NY 13063",
        "region": "Central NY",
        "difficulty_range": "Easy–Hard",
        "season": "Year-round",
        "description": "Large county forest park with over 20 miles of hiking trails through rolling hills, fields, and forest.",
        "full_description": "Highland Forest, known as the 'Adirondacks of Central New York,' offers a vast trail network starting from its Skyline Lodge. Trails range from easy meadow loops to the 8.6-mile Main Trail that circles the park. The terrain is gently rolling, making it accessible for families but also appealing to long-distance hikers. The park is open year-round, with trails used for hiking in warm months and cross-country skiing in winter.",
        "place_id": null,
        "place_query": "Highland Forest trailhead Fabius NY"
      },
      {
        "name": "Clark Reservation State Park (Cliff Trailhead)",
        "lat": 42.9968,
        "lng": -76.0823,
        "location": "6105 E Seneca Turnpike, Jamesville, NY 13078",
        "region": "Central NY",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead to the rocky Cliff Trail offering views over the glacial lake basin.",
        "full_description": "The Cliff Trail is the most challenging path in Clark Reservation, beginning near the park's visitor center. It scrambles along the rim of limestone cliffs with dramatic views down to Glacier Lake. Though short, it is rugged and rocky, offering a taste of wilderness close to Syracuse. Families with adventurous kids often enjoy it as a mini climbing challenge. Open all year but can be icy in winter.",
        "place_id": null,
        "place_query": "Cliff Trailhead Clark Reservation Jamesville NY"
      },
      {
        "name": "Onondaga Lake Park West Shore Trailhead",
        "lat": 43.0986,
        "lng": -76.2214,
        "location": "3957 Long Branch Rd, Liverpool, NY 13090",
        "region": "Central NY",
        "difficulty_range": "Easy",
        "season": "Year-round",
        "description": "Paved, stroller- and bike-friendly trail along the western shore of Onondaga Lake.",
        "full_description": "This popular multi-use path begins at the Long Branch parking area and follows Onondaga Lake's shoreline for several miles. The West Shore Trail is level, paved, and perfect for families with small children or strollers. While not a mountain hike, it is one of Central NY's most popular walking and running trails, offering lake views, wetlands, and birdwatching opportunities. Open all year, with restrooms and picnic areas nearby.",
        "place_id": null,
        "place_query": "Onondaga Lake Park West Shore trailhead Liverpool NY"
      }
    ]
  },
  {
    "region": "Tug Hill Plateau",
    "trails": [
      {
        "name": "Southwick Beach State Park Trailhead",
        "lat": 43.7161,
        "lng": -76.1989,
        "location": "8119 Southwick Pl, Henderson, NY 13650",
        "region": "Tug Hill Plateau",
        "difficulty_range": "Easy",
        "season": "Summer–Fall",
        "description": "Trailhead for sandy beach walks and dunes at Southwick Beach, part of a unique freshwater coastal environment.",
        "full_description": "Southwick Beach State Park sits on Lake Ontario's eastern shore, offering access to long sandy beaches and dune trails. The trailhead connects to a network of easy paths through the Lakeview Wildlife Management Area, where visitors can explore rare dune ecosystems and wetlands. It's a family-friendly area best visited in summer and fall. Birdwatchers flock here to see migrating species, while kids enjoy the sandy shoreline and shallow water.",
        "place_id": null,
        "place_query": "Southwick Beach State Park trailhead Henderson NY"
      },
      {
        "name": "Whetstone Gulf State Park Trailhead",
        "lat": 43.7351,
        "lng": -75.4137,
        "location": "6065 W Road, Lowville, NY 13367",
        "region": "Tug Hill Plateau",
        "difficulty_range": "Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead for rim and gorge trails circling a dramatic 3-mile canyon carved into the Tug Hill Plateau.",
        "full_description": "Whetstone Gulf State Park features one of the most scenic gorges in upstate New York, a 3-mile canyon cut into the Tug Hill Plateau. From the main trailhead, hikers can take rim trails along the canyon edge with constant overlooks, or descend into the gorge itself. Trails are about 5 miles round trip and moderately challenging. Open spring through fall, it's a hidden gem known for solitude, rugged scenery, and fall colors.",
        "place_id": null,
        "place_query": "Whetstone Gulf State Park trailhead Lowville NY"
      }
    ]
  },
  {
    "region": "Thousand Islands",
    "trails": [
      {
        "name": "Wellesley Island State Park (Minna Anthony Common Nature Center Trailhead)",
        "lat": 44.3332,
        "lng": -75.985,
        "location": "44927 Cross Island Rd, Wellesley Island, NY 13640",
        "region": "Thousand Islands",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead at the Minna Anthony Common Nature Center with scenic trails through forest, wetlands, and St. Lawrence River overlooks.",
        "full_description": "This nature center trailhead in Wellesley Island State Park is one of the premier hiking destinations in the Thousand Islands. Trails range from short loops suitable for children to longer routes that explore diverse habitats, including wildflower meadows, wetlands, and rocky river overlooks. Educational exhibits and guided programs make it especially family-friendly. Trails are open spring through fall, with some access in winter for snowshoeing.",
        "place_id": null,
        "place_query": "Wellesley Island Nature Center trailhead NY"
      },
      {
        "name": "Grass Point State Park Trailhead",
        "lat": 44.3202,
        "lng": -75.9923,
        "location": "42247 Grassy Point Rd, Alexandria Bay, NY 13607",
        "region": "Thousand Islands",
        "difficulty_range": "Easy",
        "season": "Spring–Fall",
        "description": "Small trail system along the St. Lawrence River with views of passing ships and access to shoreline picnic areas.",
        "full_description": "Grass Point State Park provides gentle walking trails along the St. Lawrence River, perfect for young children and families. The trailhead connects to short paths through forest and along the riverbank, with excellent opportunities to view ships navigating the channel. Open spring through fall, the park also features a sandy beach and picnic areas, making it a relaxed stop for light hiking and riverside play.",
        "place_id": null,
        "place_query": "Grass Point State Park trailhead Alexandria Bay NY"
      }
    ]
  },
  {
    "region": "Southern Tier",
    "trails": [
      {
        "name": "Rock City Park Trailhead",
        "lat": 42.0921,
        "lng": -78.4056,
        "location": "505 NY-16, Olean, NY 14760",
        "region": "Southern Tier",
        "difficulty_range": "Easy–Moderate",
        "season": "Spring–Fall",
        "description": "Trailhead to a privately run park with giant rock formations, crevices, and panoramic views over the Southern Tier.",
        "full_description": "Rock City Park near Olean features a trail winding through a remarkable landscape of enormous quartz conglomerate rocks. The formations create narrow passageways and caves that delight children and adventurous hikers. A loop trail explores the boulder field before reaching a scenic overlook with expansive views of the Allegheny Plateau. The park is privately operated, with a small admission fee, and is open seasonally from spring through fall.",
        "place_id": null,
        "place_query": "Rock City Park trailhead Olean NY"
      },
      {
        "name": "Lime Hollow Nature Center Trailhead",
        "lat": 42.5746,
        "lng": -76.2297,
        "location": "338 McLean Rd, Cortland, NY 13045",
        "region": "Southern Tier",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead for 12 miles of trails through forests, wetlands, and fields at a conservation center in Cortland.",
        "full_description": "The Lime Hollow Nature Center provides year-round hiking opportunities on a 430-acre preserve. Trails explore diverse habitats, including bogs, forests, and meadows. Boardwalks cross wetlands rich in wildlife, and interpretive signage makes it a great destination for families and school groups. The main visitor center has restrooms and maps. Trails are mostly easy, with a few moderate sections, and are open daily throughout the year.",
        "place_id": null,
        "place_query": "Lime Hollow Nature Center trailhead Cortland NY"
      },
      {
        "name": "Jones Hill / Labrador Hollow Trailhead",
        "lat": 42.7521,
        "lng": -76.0118,
        "location": "Labrador Hollow Unique Area, Tully, NY 13159",
        "region": "Southern Tier",
        "difficulty_range": "Moderate",
        "season": "Year-round",
        "description": "Trailhead into Labrador Hollow, leading to Jones Hill and an overlook of the glacial valley below.",
        "full_description": "This DEC-managed trailhead gives access to Labrador Hollow Unique Area, a glacial valley with wetlands, boardwalks, and scenic overlooks. The main climb up Jones Hill gains 800 feet in about 1.5 miles, ending at Hang Glider Launch, a dramatic cliff-top view across the valley. Families often combine the hike with a walk to nearby Tinker Falls, one of the most picturesque waterfalls in Central NY. Trails are open year-round, though steep sections can be icy in winter.",
        "place_id": null,
        "place_query": "Jones Hill Labrador Hollow trailhead Tully NY"
      }
    ]
  },
  {
    "region": "North Country",
    "trails": [
      {
        "name": "Black River Trailhead",
        "lat": 43.9856,
        "lng": -75.9097,
        "location": "Waterworks Park, Watertown, NY 13601",
        "region": "North Country",
        "difficulty_range": "Easy",
        "season": "Year-round",
        "description": "Trailhead for a paved, family-friendly riverside path along the Black River in Watertown.",
        "full_description": "The Black River Trail offers a 4.5-mile paved multi-use path starting from Waterworks Park in Watertown. It follows the Black River through forested sections and along the riverbank, with benches and interpretive signs along the way. While not a wilderness hike, it is highly popular with walkers, joggers, and families seeking an accessible outdoor experience in the North Country. Open year-round, the trail is especially beautiful in autumn and is frequented by birdwatchers.",
        "place_id": null,
        "place_query": "Black River Trailhead Watertown NY"
      },
      {
        "name": "Point au Roche State Park Trailhead",
        "lat": 44.7574,
        "lng": -73.3956,
        "location": "19 Camp Red Cloud Rd, Plattsburgh, NY 12901",
        "region": "North Country",
        "difficulty_range": "Easy–Moderate",
        "season": "Year-round",
        "description": "Trailhead for a network of shoreline and forest trails on Lake Champlain north of Plattsburgh.",
        "full_description": "Point au Roche State Park offers more than 12 miles of trails starting from its visitor center trailhead. Paths lead through forest, wetlands, and along the Lake Champlain shoreline, with excellent opportunities for birdwatching and scenic views across the lake to Vermont's Green Mountains. Trails are mostly flat and family-friendly, open year-round, and popular for hiking, running, and cross-country skiing in winter.",
        "place_id": null,
        "place_query": "Point au Roche State Park trailhead Plattsburgh NY"
      }
    ]
  }
]